Contents of the .debug_info section:

  Compilation Unit @ offset 0:
   Length:        0x5a9 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0
   Pointer Size:  4
 <0><c>: Abbrev Number: 10 (DW_TAG_compile_unit)
    <d>   DW_AT_producer    : (indirect string, offset: 0xfb67a): GNU C11 12.3.1 20230626 -mcpu=cortex-m33 -mfpu=fpv5-sp-d16 -mfloat-abi=hard -mthumb -march=armv8-m.main+dsp+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <11>   DW_AT_language    : 29	(C11)
    <12>   DW_AT_name        : (indirect string, offset: 0x13bb28): ../AZURE_RTOS/App/app_azure_rtos.c
    <16>   DW_AT_comp_dir    : (indirect string, offset: 0x2fe81): C:/Users/ranem/iCloudDrive/1/3_ThreadX_Mailbox/Debug
    <1a>   DW_AT_ranges      : 0xc
    <1e>   DW_AT_low_pc      : 0
    <22>   DW_AT_stmt_list   : 0
    <26>   DW_AT_macros      : 0
 <1><2a>: Abbrev Number: 2 (DW_TAG_base_type)
    <2b>   DW_AT_byte_size   : 4
    <2c>   DW_AT_encoding    : 7	(unsigned)
    <2d>   DW_AT_name        : (indirect string, offset: 0x95d5a): unsigned int
 <1><31>: Abbrev Number: 11 (DW_TAG_base_type)
    <32>   DW_AT_byte_size   : 4
    <33>   DW_AT_encoding    : 5	(signed)
    <34>   DW_AT_name        : int
 <1><38>: Abbrev Number: 2 (DW_TAG_base_type)
    <39>   DW_AT_byte_size   : 8
    <3a>   DW_AT_encoding    : 5	(signed)
    <3b>   DW_AT_name        : (indirect string, offset: 0x9267): long long int
 <1><3f>: Abbrev Number: 2 (DW_TAG_base_type)
    <40>   DW_AT_byte_size   : 8
    <41>   DW_AT_encoding    : 4	(float)
    <42>   DW_AT_name        : (indirect string, offset: 0xba09d): long double
 <1><46>: Abbrev Number: 2 (DW_TAG_base_type)
    <47>   DW_AT_byte_size   : 1
    <48>   DW_AT_encoding    : 6	(signed char)
    <49>   DW_AT_name        : (indirect string, offset: 0xd5d84): signed char
 <1><4d>: Abbrev Number: 2 (DW_TAG_base_type)
    <4e>   DW_AT_byte_size   : 1
    <4f>   DW_AT_encoding    : 8	(unsigned char)
    <50>   DW_AT_name        : (indirect string, offset: 0x7b080): unsigned char
 <1><54>: Abbrev Number: 2 (DW_TAG_base_type)
    <55>   DW_AT_byte_size   : 2
    <56>   DW_AT_encoding    : 5	(signed)
    <57>   DW_AT_name        : (indirect string, offset: 0x86f54): short int
 <1><5b>: Abbrev Number: 2 (DW_TAG_base_type)
    <5c>   DW_AT_byte_size   : 2
    <5d>   DW_AT_encoding    : 7	(unsigned)
    <5e>   DW_AT_name        : (indirect string, offset: 0x5a5fb): short unsigned int
 <1><62>: Abbrev Number: 2 (DW_TAG_base_type)
    <63>   DW_AT_byte_size   : 4
    <64>   DW_AT_encoding    : 5	(signed)
    <65>   DW_AT_name        : (indirect string, offset: 0x50de1): long int
 <1><69>: Abbrev Number: 2 (DW_TAG_base_type)
    <6a>   DW_AT_byte_size   : 4
    <6b>   DW_AT_encoding    : 7	(unsigned)
    <6c>   DW_AT_name        : (indirect string, offset: 0x96277): long unsigned int
 <1><70>: Abbrev Number: 2 (DW_TAG_base_type)
    <71>   DW_AT_byte_size   : 8
    <72>   DW_AT_encoding    : 7	(unsigned)
    <73>   DW_AT_name        : (indirect string, offset: 0xa5307): long long unsigned int
 <1><77>: Abbrev Number: 12 (DW_TAG_pointer_type)
    <78>   DW_AT_byte_size   : 4
 <1><79>: Abbrev Number: 2 (DW_TAG_base_type)
    <7a>   DW_AT_byte_size   : 1
    <7b>   DW_AT_encoding    : 8	(unsigned char)
    <7c>   DW_AT_name        : (indirect string, offset: 0xd5d8b): char
 <1><80>: Abbrev Number: 5 (DW_TAG_typedef)
    <81>   DW_AT_name        : (indirect string, offset: 0xab90c): CHAR
    <85>   DW_AT_decl_file   : 2
    <85>   DW_AT_decl_line   : 118
    <86>   DW_AT_decl_column : 49
    <86>   DW_AT_type        : <0x79>
 <1><8a>: Abbrev Number: 5 (DW_TAG_typedef)
    <8b>   DW_AT_name        : (indirect string, offset: 0xab90b): UCHAR
    <8f>   DW_AT_decl_file   : 2
    <8f>   DW_AT_decl_line   : 119
    <90>   DW_AT_decl_column : 49
    <90>   DW_AT_type        : <0x4d>
 <1><94>: Abbrev Number: 5 (DW_TAG_typedef)
    <95>   DW_AT_name        : (indirect string, offset: 0xe03d1): UINT
    <99>   DW_AT_decl_file   : 2
    <99>   DW_AT_decl_line   : 121
    <9a>   DW_AT_decl_column : 49
    <9a>   DW_AT_type        : <0x2a>
 <1><9e>: Abbrev Number: 5 (DW_TAG_typedef)
    <9f>   DW_AT_name        : (indirect string, offset: 0xa3499): ULONG
    <a3>   DW_AT_decl_file   : 2
    <a3>   DW_AT_decl_line   : 123
    <a4>   DW_AT_decl_column : 49
    <a4>   DW_AT_type        : <0x69>
 <1><a8>: Abbrev Number: 6 (DW_TAG_structure_type)
    <a9>   DW_AT_name        : (indirect string, offset: 0x42d4a): TX_TIMER_INTERNAL_STRUCT
    <ad>   DW_AT_byte_size   : 28
    <ae>   DW_AT_decl_file   : 3
    <ae>   DW_AT_decl_line   : 370
    <b0>   DW_AT_decl_column : 16
    <b0>   DW_AT_sibling     : <0x110>
 <2><b4>: Abbrev Number: 1 (DW_TAG_member)
    <b5>   DW_AT_name        : (indirect string, offset: 0xe7a05): tx_timer_internal_remaining_ticks
    <b9>   DW_AT_decl_file   : 3
    <b9>   DW_AT_decl_line   : 374
    <bb>   DW_AT_decl_column : 25
    <bc>   DW_AT_type        : <0x9e>
    <c0>   DW_AT_data_member_location: 0
 <2><c1>: Abbrev Number: 1 (DW_TAG_member)
    <c2>   DW_AT_name        : (indirect string, offset: 0x10e23e): tx_timer_internal_re_initialize_ticks
    <c6>   DW_AT_decl_file   : 3
    <c6>   DW_AT_decl_line   : 375
    <c8>   DW_AT_decl_column : 25
    <c9>   DW_AT_type        : <0x9e>
    <cd>   DW_AT_data_member_location: 4
 <2><ce>: Abbrev Number: 1 (DW_TAG_member)
    <cf>   DW_AT_name        : (indirect string, offset: 0x410d6): tx_timer_internal_timeout_function
    <d3>   DW_AT_decl_file   : 3
    <d3>   DW_AT_decl_line   : 378
    <d5>   DW_AT_decl_column : 27
    <d6>   DW_AT_type        : <0x11b>
    <da>   DW_AT_data_member_location: 8
 <2><db>: Abbrev Number: 1 (DW_TAG_member)
    <dc>   DW_AT_name        : (indirect string, offset: 0x126b8e): tx_timer_internal_timeout_param
    <e0>   DW_AT_decl_file   : 3
    <e0>   DW_AT_decl_line   : 379
    <e2>   DW_AT_decl_column : 25
    <e3>   DW_AT_type        : <0x9e>
    <e7>   DW_AT_data_member_location: 12
 <2><e8>: Abbrev Number: 1 (DW_TAG_member)
    <e9>   DW_AT_name        : (indirect string, offset: 0x8758e): tx_timer_internal_active_next
    <ed>   DW_AT_decl_file   : 3
    <ed>   DW_AT_decl_line   : 385
    <ef>   DW_AT_decl_column : 26
    <f0>   DW_AT_type        : <0x120>
    <f4>   DW_AT_data_member_location: 16
 <2><f5>: Abbrev Number: 1 (DW_TAG_member)
    <f6>   DW_AT_name        : (indirect string, offset: 0xd6059): tx_timer_internal_active_previous
    <fa>   DW_AT_decl_file   : 3
    <fa>   DW_AT_decl_line   : 386
    <fc>   DW_AT_decl_column : 26
    <fd>   DW_AT_type        : <0x120>
    <101>   DW_AT_data_member_location: 20
 <2><102>: Abbrev Number: 1 (DW_TAG_member)
    <103>   DW_AT_name        : (indirect string, offset: 0xbaded): tx_timer_internal_list_head
    <107>   DW_AT_decl_file   : 3
    <107>   DW_AT_decl_line   : 390
    <109>   DW_AT_decl_column : 27
    <10a>   DW_AT_type        : <0x125>
    <10e>   DW_AT_data_member_location: 24
 <2><10f>: Abbrev Number: 0
 <1><110>: Abbrev Number: 9 (DW_TAG_subroutine_type)
    <111>   DW_AT_prototyped  : 1
    <111>   DW_AT_sibling     : <0x11b>
 <2><115>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <116>   DW_AT_type        : <0x9e>
 <2><11a>: Abbrev Number: 0
 <1><11b>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <11c>   DW_AT_byte_size   : 4
    <11c>   DW_AT_type        : <0x110>
 <1><120>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <121>   DW_AT_byte_size   : 4
    <121>   DW_AT_type        : <0xa8>
 <1><125>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <126>   DW_AT_byte_size   : 4
    <126>   DW_AT_type        : <0x120>
 <1><12a>: Abbrev Number: 7 (DW_TAG_typedef)
    <12b>   DW_AT_name        : (indirect string, offset: 0x1116de): TX_TIMER_INTERNAL
    <12f>   DW_AT_decl_file   : 3
    <12f>   DW_AT_decl_line   : 395
    <131>   DW_AT_decl_column : 3
    <131>   DW_AT_type        : <0xa8>
 <1><135>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <136>   DW_AT_byte_size   : 4
    <136>   DW_AT_type        : <0x80>
 <1><13a>: Abbrev Number: 6 (DW_TAG_structure_type)
    <13b>   DW_AT_name        : (indirect string, offset: 0x10b316): TX_THREAD_STRUCT
    <13f>   DW_AT_byte_size   : 176
    <140>   DW_AT_decl_file   : 3
    <140>   DW_AT_decl_line   : 454
    <142>   DW_AT_decl_column : 16
    <142>   DW_AT_sibling     : <0x335>
 <2><146>: Abbrev Number: 1 (DW_TAG_member)
    <147>   DW_AT_name        : (indirect string, offset: 0xe1a04): tx_thread_id
    <14b>   DW_AT_decl_file   : 3
    <14b>   DW_AT_decl_line   : 461
    <14d>   DW_AT_decl_column : 25
    <14e>   DW_AT_type        : <0x9e>
    <152>   DW_AT_data_member_location: 0
 <2><153>: Abbrev Number: 1 (DW_TAG_member)
    <154>   DW_AT_name        : (indirect string, offset: 0x135fc9): tx_thread_run_count
    <158>   DW_AT_decl_file   : 3
    <158>   DW_AT_decl_line   : 462
    <15a>   DW_AT_decl_column : 25
    <15b>   DW_AT_type        : <0x9e>
    <15f>   DW_AT_data_member_location: 4
 <2><160>: Abbrev Number: 1 (DW_TAG_member)
    <161>   DW_AT_name        : (indirect string, offset: 0x120c2d): tx_thread_stack_ptr
    <165>   DW_AT_decl_file   : 3
    <165>   DW_AT_decl_line   : 463
    <167>   DW_AT_decl_column : 26
    <168>   DW_AT_type        : <0x77>
    <16c>   DW_AT_data_member_location: 8
 <2><16d>: Abbrev Number: 1 (DW_TAG_member)
    <16e>   DW_AT_name        : (indirect string, offset: 0xffe6): tx_thread_stack_start
    <172>   DW_AT_decl_file   : 3
    <172>   DW_AT_decl_line   : 464
    <174>   DW_AT_decl_column : 26
    <175>   DW_AT_type        : <0x77>
    <179>   DW_AT_data_member_location: 12
 <2><17a>: Abbrev Number: 1 (DW_TAG_member)
    <17b>   DW_AT_name        : (indirect string, offset: 0x300bb): tx_thread_stack_end
    <17f>   DW_AT_decl_file   : 3
    <17f>   DW_AT_decl_line   : 465
    <181>   DW_AT_decl_column : 26
    <182>   DW_AT_type        : <0x77>
    <186>   DW_AT_data_member_location: 16
 <2><187>: Abbrev Number: 1 (DW_TAG_member)
    <188>   DW_AT_name        : (indirect string, offset: 0x2da90): tx_thread_stack_size
    <18c>   DW_AT_decl_file   : 3
    <18c>   DW_AT_decl_line   : 466
    <18e>   DW_AT_decl_column : 25
    <18f>   DW_AT_type        : <0x9e>
    <193>   DW_AT_data_member_location: 20
 <2><194>: Abbrev Number: 1 (DW_TAG_member)
    <195>   DW_AT_name        : (indirect string, offset: 0x14c095): tx_thread_time_slice
    <199>   DW_AT_decl_file   : 3
    <199>   DW_AT_decl_line   : 467
    <19b>   DW_AT_decl_column : 25
    <19c>   DW_AT_type        : <0x9e>
    <1a0>   DW_AT_data_member_location: 24
 <2><1a1>: Abbrev Number: 1 (DW_TAG_member)
    <1a2>   DW_AT_name        : (indirect string, offset: 0xfbe6f): tx_thread_new_time_slice
    <1a6>   DW_AT_decl_file   : 3
    <1a6>   DW_AT_decl_line   : 468
    <1a8>   DW_AT_decl_column : 25
    <1a9>   DW_AT_type        : <0x9e>
    <1ad>   DW_AT_data_member_location: 28
 <2><1ae>: Abbrev Number: 1 (DW_TAG_member)
    <1af>   DW_AT_name        : (indirect string, offset: 0x88096): tx_thread_ready_next
    <1b3>   DW_AT_decl_file   : 3
    <1b3>   DW_AT_decl_line   : 472
    <1b5>   DW_AT_decl_column : 26
    <1b6>   DW_AT_type        : <0x335>
    <1ba>   DW_AT_data_member_location: 32
 <2><1bb>: Abbrev Number: 1 (DW_TAG_member)
    <1bc>   DW_AT_name        : (indirect string, offset: 0xeb53c): tx_thread_ready_previous
    <1c0>   DW_AT_decl_file   : 3
    <1c0>   DW_AT_decl_line   : 473
    <1c2>   DW_AT_decl_column : 26
    <1c3>   DW_AT_type        : <0x335>
    <1c7>   DW_AT_data_member_location: 36
 <2><1c8>: Abbrev Number: 1 (DW_TAG_member)
    <1c9>   DW_AT_name        : (indirect string, offset: 0x1b4dd): tx_thread_name
    <1cd>   DW_AT_decl_file   : 3
    <1cd>   DW_AT_decl_line   : 481
    <1cf>   DW_AT_decl_column : 26
    <1d0>   DW_AT_type        : <0x135>
    <1d4>   DW_AT_data_member_location: 40
 <2><1d5>: Abbrev Number: 1 (DW_TAG_member)
    <1d6>   DW_AT_name        : (indirect string, offset: 0x484df): tx_thread_priority
    <1da>   DW_AT_decl_file   : 3
    <1da>   DW_AT_decl_line   : 482
    <1dc>   DW_AT_decl_column : 25
    <1dd>   DW_AT_type        : <0x94>
    <1e1>   DW_AT_data_member_location: 44
 <2><1e2>: Abbrev Number: 1 (DW_TAG_member)
    <1e3>   DW_AT_name        : (indirect string, offset: 0xff5b4): tx_thread_state
    <1e7>   DW_AT_decl_file   : 3
    <1e7>   DW_AT_decl_line   : 483
    <1e9>   DW_AT_decl_column : 25
    <1ea>   DW_AT_type        : <0x94>
    <1ee>   DW_AT_data_member_location: 48
 <2><1ef>: Abbrev Number: 1 (DW_TAG_member)
    <1f0>   DW_AT_name        : (indirect string, offset: 0x10980f): tx_thread_delayed_suspend
    <1f4>   DW_AT_decl_file   : 3
    <1f4>   DW_AT_decl_line   : 484
    <1f6>   DW_AT_decl_column : 25
    <1f7>   DW_AT_type        : <0x94>
    <1fb>   DW_AT_data_member_location: 52
 <2><1fc>: Abbrev Number: 1 (DW_TAG_member)
    <1fd>   DW_AT_name        : (indirect string, offset: 0xf9ab4): tx_thread_suspending
    <201>   DW_AT_decl_file   : 3
    <201>   DW_AT_decl_line   : 485
    <203>   DW_AT_decl_column : 25
    <204>   DW_AT_type        : <0x94>
    <208>   DW_AT_data_member_location: 56
 <2><209>: Abbrev Number: 1 (DW_TAG_member)
    <20a>   DW_AT_name        : (indirect string, offset: 0xece06): tx_thread_preempt_threshold
    <20e>   DW_AT_decl_file   : 3
    <20e>   DW_AT_decl_line   : 486
    <210>   DW_AT_decl_column : 25
    <211>   DW_AT_type        : <0x94>
    <215>   DW_AT_data_member_location: 60
 <2><216>: Abbrev Number: 1 (DW_TAG_member)
    <217>   DW_AT_name        : (indirect string, offset: 0xaa27): tx_thread_schedule_hook
    <21b>   DW_AT_decl_file   : 3
    <21b>   DW_AT_decl_line   : 491
    <21d>   DW_AT_decl_column : 27
    <21e>   DW_AT_type        : <0x34a>
    <222>   DW_AT_data_member_location: 64
 <2><223>: Abbrev Number: 1 (DW_TAG_member)
    <224>   DW_AT_name        : (indirect string, offset: 0x1088d7): tx_thread_entry
    <228>   DW_AT_decl_file   : 3
    <228>   DW_AT_decl_line   : 499
    <22a>   DW_AT_decl_column : 27
    <22b>   DW_AT_type        : <0x11b>
    <22f>   DW_AT_data_member_location: 68
 <2><230>: Abbrev Number: 1 (DW_TAG_member)
    <231>   DW_AT_name        : (indirect string, offset: 0x50abc): tx_thread_entry_parameter
    <235>   DW_AT_decl_file   : 3
    <235>   DW_AT_decl_line   : 500
    <237>   DW_AT_decl_column : 25
    <238>   DW_AT_type        : <0x9e>
    <23c>   DW_AT_data_member_location: 72
 <2><23d>: Abbrev Number: 1 (DW_TAG_member)
    <23e>   DW_AT_name        : (indirect string, offset: 0xd3df6): tx_thread_timer
    <242>   DW_AT_decl_file   : 3
    <242>   DW_AT_decl_line   : 504
    <244>   DW_AT_decl_column : 25
    <245>   DW_AT_type        : <0x12a>
    <249>   DW_AT_data_member_location: 76
 <2><24a>: Abbrev Number: 1 (DW_TAG_member)
    <24b>   DW_AT_name        : (indirect string, offset: 0xf1c05): tx_thread_suspend_cleanup
    <24f>   DW_AT_decl_file   : 3
    <24f>   DW_AT_decl_line   : 510
    <251>   DW_AT_decl_column : 27
    <252>   DW_AT_type        : <0x34a>
    <256>   DW_AT_data_member_location: 104
 <2><257>: Abbrev Number: 1 (DW_TAG_member)
    <258>   DW_AT_name        : (indirect string, offset: 0xce875): tx_thread_suspend_control_block
    <25c>   DW_AT_decl_file   : 3
    <25c>   DW_AT_decl_line   : 511
    <25e>   DW_AT_decl_column : 26
    <25f>   DW_AT_type        : <0x77>
    <263>   DW_AT_data_member_location: 108
 <2><264>: Abbrev Number: 1 (DW_TAG_member)
    <265>   DW_AT_name        : (indirect string, offset: 0x33ebc): tx_thread_suspended_next
    <269>   DW_AT_decl_file   : 3
    <269>   DW_AT_decl_line   : 513
    <26b>   DW_AT_decl_column : 26
    <26c>   DW_AT_type        : <0x335>
    <270>   DW_AT_data_member_location: 112
 <2><271>: Abbrev Number: 1 (DW_TAG_member)
    <272>   DW_AT_name        : (indirect string, offset: 0x7028f): tx_thread_suspended_previous
    <276>   DW_AT_decl_file   : 3
    <276>   DW_AT_decl_line   : 514
    <278>   DW_AT_decl_column : 26
    <279>   DW_AT_type        : <0x335>
    <27d>   DW_AT_data_member_location: 116
 <2><27e>: Abbrev Number: 1 (DW_TAG_member)
    <27f>   DW_AT_name        : (indirect string, offset: 0x92b42): tx_thread_suspend_info
    <283>   DW_AT_decl_file   : 3
    <283>   DW_AT_decl_line   : 515
    <285>   DW_AT_decl_column : 25
    <286>   DW_AT_type        : <0x9e>
    <28a>   DW_AT_data_member_location: 120
 <2><28b>: Abbrev Number: 1 (DW_TAG_member)
    <28c>   DW_AT_name        : (indirect string, offset: 0x9388f): tx_thread_additional_suspend_info
    <290>   DW_AT_decl_file   : 3
    <290>   DW_AT_decl_line   : 516
    <292>   DW_AT_decl_column : 26
    <293>   DW_AT_type        : <0x77>
    <297>   DW_AT_data_member_location: 124
 <2><298>: Abbrev Number: 1 (DW_TAG_member)
    <299>   DW_AT_name        : (indirect string, offset: 0xdee05): tx_thread_suspend_option
    <29d>   DW_AT_decl_file   : 3
    <29d>   DW_AT_decl_line   : 517
    <29f>   DW_AT_decl_column : 25
    <2a0>   DW_AT_type        : <0x94>
    <2a4>   DW_AT_data_member_location: 128
 <2><2a5>: Abbrev Number: 1 (DW_TAG_member)
    <2a6>   DW_AT_name        : (indirect string, offset: 0x833d9): tx_thread_suspend_status
    <2aa>   DW_AT_decl_file   : 3
    <2aa>   DW_AT_decl_line   : 518
    <2ac>   DW_AT_decl_column : 25
    <2ad>   DW_AT_type        : <0x94>
    <2b1>   DW_AT_data_member_location: 132
 <2><2b2>: Abbrev Number: 1 (DW_TAG_member)
    <2b3>   DW_AT_name        : (indirect string, offset: 0x456f5): tx_thread_created_next
    <2b7>   DW_AT_decl_file   : 3
    <2b7>   DW_AT_decl_line   : 527
    <2b9>   DW_AT_decl_column : 26
    <2ba>   DW_AT_type        : <0x335>
    <2be>   DW_AT_data_member_location: 136
 <2><2bf>: Abbrev Number: 1 (DW_TAG_member)
    <2c0>   DW_AT_name        : (indirect string, offset: 0x5a4bb): tx_thread_created_previous
    <2c4>   DW_AT_decl_file   : 3
    <2c4>   DW_AT_decl_line   : 528
    <2c6>   DW_AT_decl_column : 26
    <2c7>   DW_AT_type        : <0x335>
    <2cb>   DW_AT_data_member_location: 140
 <2><2cc>: Abbrev Number: 1 (DW_TAG_member)
    <2cd>   DW_AT_name        : (indirect string, offset: 0x3a2c7): tx_thread_filex_ptr
    <2d1>   DW_AT_decl_file   : 3
    <2d1>   DW_AT_decl_line   : 536
    <2d3>   DW_AT_decl_column : 26
    <2d4>   DW_AT_type        : <0x77>
    <2d8>   DW_AT_data_member_location: 144
 <2><2d9>: Abbrev Number: 1 (DW_TAG_member)
    <2da>   DW_AT_name        : (indirect string, offset: 0x3d042): tx_thread_user_priority
    <2de>   DW_AT_decl_file   : 3
    <2de>   DW_AT_decl_line   : 542
    <2e0>   DW_AT_decl_column : 25
    <2e1>   DW_AT_type        : <0x94>
    <2e5>   DW_AT_data_member_location: 148
 <2><2e6>: Abbrev Number: 1 (DW_TAG_member)
    <2e7>   DW_AT_name        : (indirect string, offset: 0x76622): tx_thread_user_preempt_threshold
    <2eb>   DW_AT_decl_file   : 3
    <2eb>   DW_AT_decl_line   : 543
    <2ed>   DW_AT_decl_column : 25
    <2ee>   DW_AT_type        : <0x94>
    <2f2>   DW_AT_data_member_location: 152
 <2><2f3>: Abbrev Number: 1 (DW_TAG_member)
    <2f4>   DW_AT_name        : (indirect string, offset: 0x942ec): tx_thread_inherit_priority
    <2f8>   DW_AT_decl_file   : 3
    <2f8>   DW_AT_decl_line   : 544
    <2fa>   DW_AT_decl_column : 25
    <2fb>   DW_AT_type        : <0x94>
    <2ff>   DW_AT_data_member_location: 156
 <2><300>: Abbrev Number: 1 (DW_TAG_member)
    <301>   DW_AT_name        : (indirect string, offset: 0x73d50): tx_thread_owned_mutex_count
    <305>   DW_AT_decl_file   : 3
    <305>   DW_AT_decl_line   : 547
    <307>   DW_AT_decl_column : 25
    <308>   DW_AT_type        : <0x94>
    <30c>   DW_AT_data_member_location: 160
 <2><30d>: Abbrev Number: 1 (DW_TAG_member)
    <30e>   DW_AT_name        : (indirect string, offset: 0xefe24): tx_thread_owned_mutex_list
    <312>   DW_AT_decl_file   : 3
    <312>   DW_AT_decl_line   : 549
    <314>   DW_AT_decl_column : 26
    <315>   DW_AT_type        : <0x405>
    <319>   DW_AT_data_member_location: 164
 <2><31a>: Abbrev Number: 1 (DW_TAG_member)
    <31b>   DW_AT_name        : (indirect string, offset: 0xad39c): tx_thread_stack_highest_ptr
    <31f>   DW_AT_decl_file   : 3
    <31f>   DW_AT_decl_line   : 589
    <321>   DW_AT_decl_column : 26
    <322>   DW_AT_type        : <0x77>
    <326>   DW_AT_data_member_location: 168
 <2><327>: Abbrev Number: 1 (DW_TAG_member)
    <328>   DW_AT_name        : (indirect string, offset: 0x13d31e): tx_thread_suspension_sequence
    <32c>   DW_AT_decl_file   : 3
    <32c>   DW_AT_decl_line   : 616
    <32e>   DW_AT_decl_column : 25
    <32f>   DW_AT_type        : <0x9e>
    <333>   DW_AT_data_member_location: 172
 <2><334>: Abbrev Number: 0
 <1><335>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <336>   DW_AT_byte_size   : 4
    <336>   DW_AT_type        : <0x13a>
 <1><33a>: Abbrev Number: 9 (DW_TAG_subroutine_type)
    <33b>   DW_AT_prototyped  : 1
    <33b>   DW_AT_sibling     : <0x34a>
 <2><33f>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <340>   DW_AT_type        : <0x335>
 <2><344>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <345>   DW_AT_type        : <0x9e>
 <2><349>: Abbrev Number: 0
 <1><34a>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <34b>   DW_AT_byte_size   : 4
    <34b>   DW_AT_type        : <0x33a>
 <1><34f>: Abbrev Number: 6 (DW_TAG_structure_type)
    <350>   DW_AT_name        : (indirect string, offset: 0xe2bc7): TX_MUTEX_STRUCT
    <354>   DW_AT_byte_size   : 52
    <355>   DW_AT_decl_file   : 3
    <355>   DW_AT_decl_line   : 872
    <357>   DW_AT_decl_column : 16
    <357>   DW_AT_sibling     : <0x405>
 <2><35b>: Abbrev Number: 1 (DW_TAG_member)
    <35c>   DW_AT_name        : (indirect string, offset: 0x3f197): tx_mutex_id
    <360>   DW_AT_decl_file   : 3
    <360>   DW_AT_decl_line   : 876
    <362>   DW_AT_decl_column : 25
    <363>   DW_AT_type        : <0x9e>
    <367>   DW_AT_data_member_location: 0
 <2><368>: Abbrev Number: 1 (DW_TAG_member)
    <369>   DW_AT_name        : (indirect string, offset: 0x9793d): tx_mutex_name
    <36d>   DW_AT_decl_file   : 3
    <36d>   DW_AT_decl_line   : 879
    <36f>   DW_AT_decl_column : 26
    <370>   DW_AT_type        : <0x135>
    <374>   DW_AT_data_member_location: 4
 <2><375>: Abbrev Number: 1 (DW_TAG_member)
    <376>   DW_AT_name        : (indirect string, offset: 0x8fc04): tx_mutex_ownership_count
    <37a>   DW_AT_decl_file   : 3
    <37a>   DW_AT_decl_line   : 882
    <37c>   DW_AT_decl_column : 25
    <37d>   DW_AT_type        : <0x94>
    <381>   DW_AT_data_member_location: 8
 <2><382>: Abbrev Number: 1 (DW_TAG_member)
    <383>   DW_AT_name        : (indirect string, offset: 0x86bcc): tx_mutex_owner
    <387>   DW_AT_decl_file   : 3
    <387>   DW_AT_decl_line   : 886
    <389>   DW_AT_decl_column : 26
    <38a>   DW_AT_type        : <0x4e0>
    <38e>   DW_AT_data_member_location: 12
 <2><38f>: Abbrev Number: 1 (DW_TAG_member)
    <390>   DW_AT_name        : (indirect string, offset: 0x4e4eb): tx_mutex_inherit
    <394>   DW_AT_decl_file   : 3
    <394>   DW_AT_decl_line   : 890
    <396>   DW_AT_decl_column : 25
    <397>   DW_AT_type        : <0x94>
    <39b>   DW_AT_data_member_location: 16
 <2><39c>: Abbrev Number: 1 (DW_TAG_member)
    <39d>   DW_AT_name        : (indirect string, offset: 0x7b9ec): tx_mutex_original_priority
    <3a1>   DW_AT_decl_file   : 3
    <3a1>   DW_AT_decl_line   : 893
    <3a3>   DW_AT_decl_column : 25
    <3a4>   DW_AT_type        : <0x94>
    <3a8>   DW_AT_data_member_location: 20
 <2><3a9>: Abbrev Number: 1 (DW_TAG_member)
    <3aa>   DW_AT_name        : (indirect string, offset: 0x79dca): tx_mutex_suspension_list
    <3ae>   DW_AT_decl_file   : 3
    <3ae>   DW_AT_decl_line   : 898
    <3b0>   DW_AT_decl_column : 26
    <3b1>   DW_AT_type        : <0x335>
    <3b5>   DW_AT_data_member_location: 24
 <2><3b6>: Abbrev Number: 1 (DW_TAG_member)
    <3b7>   DW_AT_name        : (indirect string, offset: 0x7165d): tx_mutex_suspended_count
    <3bb>   DW_AT_decl_file   : 3
    <3bb>   DW_AT_decl_line   : 899
    <3bd>   DW_AT_decl_column : 25
    <3be>   DW_AT_type        : <0x94>
    <3c2>   DW_AT_data_member_location: 28
 <2><3c3>: Abbrev Number: 1 (DW_TAG_member)
    <3c4>   DW_AT_name        : (indirect string, offset: 0x112efb): tx_mutex_created_next
    <3c8>   DW_AT_decl_file   : 3
    <3c8>   DW_AT_decl_line   : 903
    <3ca>   DW_AT_decl_column : 26
    <3cb>   DW_AT_type        : <0x405>
    <3cf>   DW_AT_data_member_location: 32
 <2><3d0>: Abbrev Number: 1 (DW_TAG_member)
    <3d1>   DW_AT_name        : (indirect string, offset: 0xc1734): tx_mutex_created_previous
    <3d5>   DW_AT_decl_file   : 3
    <3d5>   DW_AT_decl_line   : 904
    <3d7>   DW_AT_decl_column : 26
    <3d8>   DW_AT_type        : <0x405>
    <3dc>   DW_AT_data_member_location: 36
 <2><3dd>: Abbrev Number: 1 (DW_TAG_member)
    <3de>   DW_AT_name        : (indirect string, offset: 0xc9da): tx_mutex_highest_priority_waiting
    <3e2>   DW_AT_decl_file   : 3
    <3e2>   DW_AT_decl_line   : 908
    <3e4>   DW_AT_decl_column : 25
    <3e5>   DW_AT_type        : <0x94>
    <3e9>   DW_AT_data_member_location: 40
 <2><3ea>: Abbrev Number: 1 (DW_TAG_member)
    <3eb>   DW_AT_name        : (indirect string, offset: 0xe33bc): tx_mutex_owned_next
    <3ef>   DW_AT_decl_file   : 3
    <3ef>   DW_AT_decl_line   : 912
    <3f1>   DW_AT_decl_column : 26
    <3f2>   DW_AT_type        : <0x405>
    <3f6>   DW_AT_data_member_location: 44
 <2><3f7>: Abbrev Number: 1 (DW_TAG_member)
    <3f8>   DW_AT_name        : (indirect string, offset: 0x270c8): tx_mutex_owned_previous
    <3fc>   DW_AT_decl_file   : 3
    <3fc>   DW_AT_decl_line   : 913
    <3fe>   DW_AT_decl_column : 26
    <3ff>   DW_AT_type        : <0x405>
    <403>   DW_AT_data_member_location: 48
 <2><404>: Abbrev Number: 0
 <1><405>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <406>   DW_AT_byte_size   : 4
    <406>   DW_AT_type        : <0x34f>
 <1><40a>: Abbrev Number: 7 (DW_TAG_typedef)
    <40b>   DW_AT_name        : (indirect string, offset: 0xfc0a6): TX_THREAD
    <40f>   DW_AT_decl_file   : 3
    <40f>   DW_AT_decl_line   : 624
    <411>   DW_AT_decl_column : 3
    <411>   DW_AT_type        : <0x13a>
 <1><415>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <416>   DW_AT_byte_size   : 4
    <416>   DW_AT_type        : <0x8a>
 <1><41a>: Abbrev Number: 6 (DW_TAG_structure_type)
    <41b>   DW_AT_name        : (indirect string, offset: 0x12a8a1): TX_BYTE_POOL_STRUCT
    <41f>   DW_AT_byte_size   : 52
    <420>   DW_AT_decl_file   : 3
    <420>   DW_AT_decl_line   : 707
    <422>   DW_AT_decl_column : 16
    <422>   DW_AT_sibling     : <0x4d0>
 <2><426>: Abbrev Number: 1 (DW_TAG_member)
    <427>   DW_AT_name        : (indirect string, offset: 0x99147): tx_byte_pool_id
    <42b>   DW_AT_decl_file   : 3
    <42b>   DW_AT_decl_line   : 711
    <42d>   DW_AT_decl_column : 25
    <42e>   DW_AT_type        : <0x9e>
    <432>   DW_AT_data_member_location: 0
 <2><433>: Abbrev Number: 1 (DW_TAG_member)
    <434>   DW_AT_name        : (indirect string, offset: 0x448d6): tx_byte_pool_name
    <438>   DW_AT_decl_file   : 3
    <438>   DW_AT_decl_line   : 714
    <43a>   DW_AT_decl_column : 26
    <43b>   DW_AT_type        : <0x135>
    <43f>   DW_AT_data_member_location: 4
 <2><440>: Abbrev Number: 1 (DW_TAG_member)
    <441>   DW_AT_name        : (indirect string, offset: 0x2f471): tx_byte_pool_available
    <445>   DW_AT_decl_file   : 3
    <445>   DW_AT_decl_line   : 717
    <447>   DW_AT_decl_column : 25
    <448>   DW_AT_type        : <0x9e>
    <44c>   DW_AT_data_member_location: 8
 <2><44d>: Abbrev Number: 1 (DW_TAG_member)
    <44e>   DW_AT_name        : (indirect string, offset: 0x136fc9): tx_byte_pool_fragments
    <452>   DW_AT_decl_file   : 3
    <452>   DW_AT_decl_line   : 720
    <454>   DW_AT_decl_column : 25
    <455>   DW_AT_type        : <0x94>
    <459>   DW_AT_data_member_location: 12
 <2><45a>: Abbrev Number: 1 (DW_TAG_member)
    <45b>   DW_AT_name        : (indirect string, offset: 0xe787f): tx_byte_pool_list
    <45f>   DW_AT_decl_file   : 3
    <45f>   DW_AT_decl_line   : 723
    <461>   DW_AT_decl_column : 26
    <462>   DW_AT_type        : <0x415>
    <466>   DW_AT_data_member_location: 16
 <2><467>: Abbrev Number: 1 (DW_TAG_member)
    <468>   DW_AT_name        : (indirect string, offset: 0x10c7d5): tx_byte_pool_search
    <46c>   DW_AT_decl_file   : 3
    <46c>   DW_AT_decl_line   : 727
    <46e>   DW_AT_decl_column : 26
    <46f>   DW_AT_type        : <0x415>
    <473>   DW_AT_data_member_location: 20
 <2><474>: Abbrev Number: 1 (DW_TAG_member)
    <475>   DW_AT_name        : (indirect string, offset: 0xb8039): tx_byte_pool_start
    <479>   DW_AT_decl_file   : 3
    <479>   DW_AT_decl_line   : 730
    <47b>   DW_AT_decl_column : 26
    <47c>   DW_AT_type        : <0x415>
    <480>   DW_AT_data_member_location: 24
 <2><481>: Abbrev Number: 1 (DW_TAG_member)
    <482>   DW_AT_name        : (indirect string, offset: 0xe8e01): tx_byte_pool_size
    <486>   DW_AT_decl_file   : 3
    <486>   DW_AT_decl_line   : 733
    <488>   DW_AT_decl_column : 25
    <489>   DW_AT_type        : <0x9e>
    <48d>   DW_AT_data_member_location: 28
 <2><48e>: Abbrev Number: 1 (DW_TAG_member)
    <48f>   DW_AT_name        : (indirect string, offset: 0xa30e7): tx_byte_pool_owner
    <493>   DW_AT_decl_file   : 3
    <493>   DW_AT_decl_line   : 739
    <495>   DW_AT_decl_column : 26
    <496>   DW_AT_type        : <0x335>
    <49a>   DW_AT_data_member_location: 32
 <2><49b>: Abbrev Number: 1 (DW_TAG_member)
    <49c>   DW_AT_name        : (indirect string, offset: 0xd9b8c): tx_byte_pool_suspension_list
    <4a0>   DW_AT_decl_file   : 3
    <4a0>   DW_AT_decl_line   : 744
    <4a2>   DW_AT_decl_column : 26
    <4a3>   DW_AT_type        : <0x335>
    <4a7>   DW_AT_data_member_location: 36
 <2><4a8>: Abbrev Number: 1 (DW_TAG_member)
    <4a9>   DW_AT_name        : (indirect string, offset: 0xd2ab4): tx_byte_pool_suspended_count
    <4ad>   DW_AT_decl_file   : 3
    <4ad>   DW_AT_decl_line   : 745
    <4af>   DW_AT_decl_column : 25
    <4b0>   DW_AT_type        : <0x94>
    <4b4>   DW_AT_data_member_location: 40
 <2><4b5>: Abbrev Number: 1 (DW_TAG_member)
    <4b6>   DW_AT_name        : (indirect string, offset: 0xf73e5): tx_byte_pool_created_next
    <4ba>   DW_AT_decl_file   : 3
    <4ba>   DW_AT_decl_line   : 749
    <4bc>   DW_AT_decl_column : 26
    <4bd>   DW_AT_type        : <0x4d0>
    <4c1>   DW_AT_data_member_location: 44
 <2><4c2>: Abbrev Number: 1 (DW_TAG_member)
    <4c3>   DW_AT_name        : (indirect string, offset: 0x2ba45): tx_byte_pool_created_previous
    <4c7>   DW_AT_decl_file   : 3
    <4c7>   DW_AT_decl_line   : 750
    <4c9>   DW_AT_decl_column : 26
    <4ca>   DW_AT_type        : <0x4d0>
    <4ce>   DW_AT_data_member_location: 48
 <2><4cf>: Abbrev Number: 0
 <1><4d0>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <4d1>   DW_AT_byte_size   : 4
    <4d1>   DW_AT_type        : <0x41a>
 <1><4d5>: Abbrev Number: 7 (DW_TAG_typedef)
    <4d6>   DW_AT_name        : (indirect string, offset: 0x86c61): TX_BYTE_POOL
    <4da>   DW_AT_decl_file   : 3
    <4da>   DW_AT_decl_line   : 781
    <4dc>   DW_AT_decl_column : 3
    <4dc>   DW_AT_type        : <0x41a>
 <1><4e0>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <4e1>   DW_AT_byte_size   : 4
    <4e1>   DW_AT_type        : <0x40a>
 <1><4e5>: Abbrev Number: 2 (DW_TAG_base_type)
    <4e6>   DW_AT_byte_size   : 4
    <4e7>   DW_AT_encoding    : 4	(float)
    <4e8>   DW_AT_name        : (indirect string, offset: 0x6aff3): float
 <1><4ec>: Abbrev Number: 2 (DW_TAG_base_type)
    <4ed>   DW_AT_byte_size   : 8
    <4ee>   DW_AT_encoding    : 4	(float)
    <4ef>   DW_AT_name        : (indirect string, offset: 0x75191): double
 <1><4f3>: Abbrev Number: 13 (DW_TAG_array_type)
    <4f4>   DW_AT_type        : <0x8a>
    <4f8>   DW_AT_sibling     : <0x504>
 <2><4fc>: Abbrev Number: 14 (DW_TAG_subrange_type)
    <4fd>   DW_AT_type        : <0x2a>
    <501>   DW_AT_upper_bound : 1023
 <2><503>: Abbrev Number: 0
 <1><504>: Abbrev Number: 15 (DW_TAG_variable)
    <505>   DW_AT_name        : (indirect string, offset: 0x6c0b0): tx_byte_pool_buffer
    <509>   DW_AT_decl_file   : 1
    <50a>   DW_AT_decl_line   : 55
    <50b>   DW_AT_decl_column : 28
    <50c>   DW_AT_type        : <0x4f3>
    <510>   DW_AT_alignment   : 4
    <511>   DW_AT_location    : 5 byte block: 3 88 0 0 20 	(DW_OP_addr: 20000088)
 <1><517>: Abbrev Number: 8 (DW_TAG_variable)
    <518>   DW_AT_name        : (indirect string, offset: 0xdcbba): tx_app_byte_pool
    <51c>   DW_AT_decl_file   : 1
    <51c>   DW_AT_decl_line   : 56
    <51d>   DW_AT_decl_column : 21
    <51e>   DW_AT_type        : <0x4d5>
    <522>   DW_AT_location    : 5 byte block: 3 88 4 0 20 	(DW_OP_addr: 20000488)
 <1><528>: Abbrev Number: 16 (DW_TAG_subprogram)
    <529>   DW_AT_external    : 1
    <529>   DW_AT_name        : (indirect string, offset: 0x6d5cb): App_ThreadX_Init
    <52d>   DW_AT_decl_file   : 4
    <52e>   DW_AT_decl_line   : 64
    <52f>   DW_AT_decl_column : 6
    <530>   DW_AT_prototyped  : 1
    <530>   DW_AT_type        : <0x94>
    <534>   DW_AT_declaration : 1
    <534>   DW_AT_sibling     : <0x53e>
 <2><538>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <539>   DW_AT_type        : <0x77>
 <2><53d>: Abbrev Number: 0
 <1><53e>: Abbrev Number: 17 (DW_TAG_subprogram)
    <53f>   DW_AT_external    : 1
    <53f>   DW_AT_name        : (indirect string, offset: 0x8c27): _txe_byte_pool_create
    <543>   DW_AT_decl_file   : 3
    <544>   DW_AT_decl_line   : 1520
    <546>   DW_AT_decl_column : 13
    <547>   DW_AT_prototyped  : 1
    <547>   DW_AT_type        : <0x94>
    <54b>   DW_AT_declaration : 1
    <54b>   DW_AT_sibling     : <0x569>
 <2><54f>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <550>   DW_AT_type        : <0x569>
 <2><554>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <555>   DW_AT_type        : <0x135>
 <2><559>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <55a>   DW_AT_type        : <0x77>
 <2><55e>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <55f>   DW_AT_type        : <0x9e>
 <2><563>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <564>   DW_AT_type        : <0x94>
 <2><568>: Abbrev Number: 0
 <1><569>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <56a>   DW_AT_byte_size   : 4
    <56a>   DW_AT_type        : <0x4d5>
 <1><56e>: Abbrev Number: 18 (DW_TAG_subprogram)
    <56f>   DW_AT_external    : 1
    <56f>   DW_AT_name        : (indirect string, offset: 0xdc529): tx_application_define
    <573>   DW_AT_decl_file   : 1
    <574>   DW_AT_decl_line   : 70
    <575>   DW_AT_decl_column : 6
    <576>   DW_AT_prototyped  : 1
    <576>   DW_AT_low_pc      : 0x80007e0
    <57a>   DW_AT_high_pc     : 0x50
    <57e>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <580>   DW_AT_call_all_tail_calls: 1
 <2><580>: Abbrev Number: 19 (DW_TAG_formal_parameter)
    <581>   DW_AT_name        : (indirect string, offset: 0xac0d1): first_unused_memory
    <585>   DW_AT_decl_file   : 1
    <586>   DW_AT_decl_line   : 70
    <587>   DW_AT_decl_column : 34
    <588>   DW_AT_type        : <0x77>
    <58c>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><58f>: Abbrev Number: 8 (DW_TAG_variable)
    <590>   DW_AT_name        : (indirect string, offset: 0x833eb): status
    <594>   DW_AT_decl_file   : 1
    <594>   DW_AT_decl_line   : 76
    <595>   DW_AT_decl_column : 8
    <596>   DW_AT_type        : <0x94>
    <59a>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><59d>: Abbrev Number: 8 (DW_TAG_variable)
    <59e>   DW_AT_name        : (indirect string, offset: 0x79275): memory_ptr
    <5a2>   DW_AT_decl_file   : 1
    <5a2>   DW_AT_decl_line   : 77
    <5a3>   DW_AT_decl_column : 9
    <5a4>   DW_AT_type        : <0x77>
    <5a8>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><5ab>: Abbrev Number: 0
 <1><5ac>: Abbrev Number: 0
  Compilation Unit @ offset 0x5ad:
   Length:        0xda4 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x124
   Pointer Size:  4
 <0><5b9>: Abbrev Number: 24 (DW_TAG_compile_unit)
    <5ba>   DW_AT_producer    : (indirect string, offset: 0xfb67a): GNU C11 12.3.1 20230626 -mcpu=cortex-m33 -mfpu=fpv5-sp-d16 -mfloat-abi=hard -mthumb -march=armv8-m.main+dsp+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <5be>   DW_AT_language    : 29	(C11)
    <5bf>   DW_AT_name        : (indirect string, offset: 0x1408bc): ../Core/Src/app_threadx.c
    <5c3>   DW_AT_comp_dir    : (indirect string, offset: 0x2fe81): C:/Users/ranem/iCloudDrive/1/3_ThreadX_Mailbox/Debug
    <5c7>   DW_AT_ranges      : 0x1f
    <5cb>   DW_AT_low_pc      : 0
    <5cf>   DW_AT_stmt_list   : 0x9dc
    <5d3>   DW_AT_macros      : 0x301d3
 <1><5d7>: Abbrev Number: 6 (DW_TAG_base_type)
    <5d8>   DW_AT_byte_size   : 4
    <5d9>   DW_AT_encoding    : 7	(unsigned)
    <5da>   DW_AT_name        : (indirect string, offset: 0x95d5a): unsigned int
 <1><5de>: Abbrev Number: 25 (DW_TAG_base_type)
    <5df>   DW_AT_byte_size   : 4
    <5e0>   DW_AT_encoding    : 5	(signed)
    <5e1>   DW_AT_name        : int
 <1><5e5>: Abbrev Number: 6 (DW_TAG_base_type)
    <5e6>   DW_AT_byte_size   : 8
    <5e7>   DW_AT_encoding    : 5	(signed)
    <5e8>   DW_AT_name        : (indirect string, offset: 0x9267): long long int
 <1><5ec>: Abbrev Number: 6 (DW_TAG_base_type)
    <5ed>   DW_AT_byte_size   : 8
    <5ee>   DW_AT_encoding    : 4	(float)
    <5ef>   DW_AT_name        : (indirect string, offset: 0xba09d): long double
 <1><5f3>: Abbrev Number: 6 (DW_TAG_base_type)
    <5f4>   DW_AT_byte_size   : 1
    <5f5>   DW_AT_encoding    : 6	(signed char)
    <5f6>   DW_AT_name        : (indirect string, offset: 0xd5d84): signed char
 <1><5fa>: Abbrev Number: 4 (DW_TAG_typedef)
    <5fb>   DW_AT_name        : (indirect string, offset: 0x140ffe): __uint8_t
    <5ff>   DW_AT_decl_file   : 2
    <600>   DW_AT_decl_line   : 43
    <601>   DW_AT_decl_column : 24
    <602>   DW_AT_type        : <0x606>
 <1><606>: Abbrev Number: 6 (DW_TAG_base_type)
    <607>   DW_AT_byte_size   : 1
    <608>   DW_AT_encoding    : 8	(unsigned char)
    <609>   DW_AT_name        : (indirect string, offset: 0x7b080): unsigned char
 <1><60d>: Abbrev Number: 6 (DW_TAG_base_type)
    <60e>   DW_AT_byte_size   : 2
    <60f>   DW_AT_encoding    : 5	(signed)
    <610>   DW_AT_name        : (indirect string, offset: 0x86f54): short int
 <1><614>: Abbrev Number: 4 (DW_TAG_typedef)
    <615>   DW_AT_name        : (indirect string, offset: 0x140575): __uint16_t
    <619>   DW_AT_decl_file   : 2
    <61a>   DW_AT_decl_line   : 57
    <61b>   DW_AT_decl_column : 25
    <61c>   DW_AT_type        : <0x620>
 <1><620>: Abbrev Number: 6 (DW_TAG_base_type)
    <621>   DW_AT_byte_size   : 2
    <622>   DW_AT_encoding    : 7	(unsigned)
    <623>   DW_AT_name        : (indirect string, offset: 0x5a5fb): short unsigned int
 <1><627>: Abbrev Number: 4 (DW_TAG_typedef)
    <628>   DW_AT_name        : (indirect string, offset: 0x140eed): __int32_t
    <62c>   DW_AT_decl_file   : 2
    <62d>   DW_AT_decl_line   : 77
    <62e>   DW_AT_decl_column : 24
    <62f>   DW_AT_type        : <0x633>
 <1><633>: Abbrev Number: 6 (DW_TAG_base_type)
    <634>   DW_AT_byte_size   : 4
    <635>   DW_AT_encoding    : 5	(signed)
    <636>   DW_AT_name        : (indirect string, offset: 0x50de1): long int
 <1><63a>: Abbrev Number: 4 (DW_TAG_typedef)
    <63b>   DW_AT_name        : (indirect string, offset: 0x14065d): __uint32_t
    <63f>   DW_AT_decl_file   : 2
    <640>   DW_AT_decl_line   : 79
    <641>   DW_AT_decl_column : 25
    <642>   DW_AT_type        : <0x646>
 <1><646>: Abbrev Number: 6 (DW_TAG_base_type)
    <647>   DW_AT_byte_size   : 4
    <648>   DW_AT_encoding    : 7	(unsigned)
    <649>   DW_AT_name        : (indirect string, offset: 0x96277): long unsigned int
 <1><64d>: Abbrev Number: 6 (DW_TAG_base_type)
    <64e>   DW_AT_byte_size   : 8
    <64f>   DW_AT_encoding    : 7	(unsigned)
    <650>   DW_AT_name        : (indirect string, offset: 0xa5307): long long unsigned int
 <1><654>: Abbrev Number: 26 (DW_TAG_pointer_type)
    <655>   DW_AT_byte_size   : 4
 <1><656>: Abbrev Number: 6 (DW_TAG_base_type)
    <657>   DW_AT_byte_size   : 1
    <658>   DW_AT_encoding    : 8	(unsigned char)
    <659>   DW_AT_name        : (indirect string, offset: 0xd5d8b): char
 <1><65d>: Abbrev Number: 27 (DW_TAG_const_type)
    <65e>   DW_AT_type        : <0x656>
 <1><662>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <663>   DW_AT_byte_size   : 4
    <663>   DW_AT_type        : <0x65d>
 <1><667>: Abbrev Number: 4 (DW_TAG_typedef)
    <668>   DW_AT_name        : (indirect string, offset: 0xab90c): CHAR
    <66c>   DW_AT_decl_file   : 3
    <66d>   DW_AT_decl_line   : 118
    <66e>   DW_AT_decl_column : 49
    <66f>   DW_AT_type        : <0x656>
 <1><673>: Abbrev Number: 4 (DW_TAG_typedef)
    <674>   DW_AT_name        : (indirect string, offset: 0xe03d1): UINT
    <678>   DW_AT_decl_file   : 3
    <679>   DW_AT_decl_line   : 121
    <67a>   DW_AT_decl_column : 49
    <67b>   DW_AT_type        : <0x5d7>
 <1><67f>: Abbrev Number: 4 (DW_TAG_typedef)
    <680>   DW_AT_name        : (indirect string, offset: 0xa349a): LONG
    <684>   DW_AT_decl_file   : 3
    <685>   DW_AT_decl_line   : 122
    <686>   DW_AT_decl_column : 49
    <687>   DW_AT_type        : <0x633>
 <1><68b>: Abbrev Number: 4 (DW_TAG_typedef)
    <68c>   DW_AT_name        : (indirect string, offset: 0xa3499): ULONG
    <690>   DW_AT_decl_file   : 3
    <691>   DW_AT_decl_line   : 123
    <692>   DW_AT_decl_column : 49
    <693>   DW_AT_type        : <0x646>
 <1><697>: Abbrev Number: 14 (DW_TAG_structure_type)
    <698>   DW_AT_name        : (indirect string, offset: 0x42d4a): TX_TIMER_INTERNAL_STRUCT
    <69c>   DW_AT_byte_size   : 28
    <69d>   DW_AT_decl_file   : 4
    <69d>   DW_AT_decl_line   : 370
    <69f>   DW_AT_decl_column : 16
    <69f>   DW_AT_sibling     : <0x706>
 <2><6a3>: Abbrev Number: 1 (DW_TAG_member)
    <6a4>   DW_AT_name        : (indirect string, offset: 0xe7a05): tx_timer_internal_remaining_ticks
    <6a8>   DW_AT_decl_file   : 4
    <6a9>   DW_AT_decl_line   : 374
    <6ab>   DW_AT_decl_column : 25
    <6ac>   DW_AT_type        : <0x68b>
    <6b0>   DW_AT_data_member_location: 0
 <2><6b1>: Abbrev Number: 1 (DW_TAG_member)
    <6b2>   DW_AT_name        : (indirect string, offset: 0x10e23e): tx_timer_internal_re_initialize_ticks
    <6b6>   DW_AT_decl_file   : 4
    <6b7>   DW_AT_decl_line   : 375
    <6b9>   DW_AT_decl_column : 25
    <6ba>   DW_AT_type        : <0x68b>
    <6be>   DW_AT_data_member_location: 4
 <2><6bf>: Abbrev Number: 1 (DW_TAG_member)
    <6c0>   DW_AT_name        : (indirect string, offset: 0x410d6): tx_timer_internal_timeout_function
    <6c4>   DW_AT_decl_file   : 4
    <6c5>   DW_AT_decl_line   : 378
    <6c7>   DW_AT_decl_column : 27
    <6c8>   DW_AT_type        : <0x711>
    <6cc>   DW_AT_data_member_location: 8
 <2><6cd>: Abbrev Number: 1 (DW_TAG_member)
    <6ce>   DW_AT_name        : (indirect string, offset: 0x126b8e): tx_timer_internal_timeout_param
    <6d2>   DW_AT_decl_file   : 4
    <6d3>   DW_AT_decl_line   : 379
    <6d5>   DW_AT_decl_column : 25
    <6d6>   DW_AT_type        : <0x68b>
    <6da>   DW_AT_data_member_location: 12
 <2><6db>: Abbrev Number: 1 (DW_TAG_member)
    <6dc>   DW_AT_name        : (indirect string, offset: 0x8758e): tx_timer_internal_active_next
    <6e0>   DW_AT_decl_file   : 4
    <6e1>   DW_AT_decl_line   : 385
    <6e3>   DW_AT_decl_column : 26
    <6e4>   DW_AT_type        : <0x716>
    <6e8>   DW_AT_data_member_location: 16
 <2><6e9>: Abbrev Number: 1 (DW_TAG_member)
    <6ea>   DW_AT_name        : (indirect string, offset: 0xd6059): tx_timer_internal_active_previous
    <6ee>   DW_AT_decl_file   : 4
    <6ef>   DW_AT_decl_line   : 386
    <6f1>   DW_AT_decl_column : 26
    <6f2>   DW_AT_type        : <0x716>
    <6f6>   DW_AT_data_member_location: 20
 <2><6f7>: Abbrev Number: 1 (DW_TAG_member)
    <6f8>   DW_AT_name        : (indirect string, offset: 0xbaded): tx_timer_internal_list_head
    <6fc>   DW_AT_decl_file   : 4
    <6fd>   DW_AT_decl_line   : 390
    <6ff>   DW_AT_decl_column : 27
    <700>   DW_AT_type        : <0x71b>
    <704>   DW_AT_data_member_location: 24
 <2><705>: Abbrev Number: 0
 <1><706>: Abbrev Number: 19 (DW_TAG_subroutine_type)
    <707>   DW_AT_prototyped  : 1
    <707>   DW_AT_sibling     : <0x711>
 <2><70b>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <70c>   DW_AT_type        : <0x68b>
 <2><710>: Abbrev Number: 0
 <1><711>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <712>   DW_AT_byte_size   : 4
    <712>   DW_AT_type        : <0x706>
 <1><716>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <717>   DW_AT_byte_size   : 4
    <717>   DW_AT_type        : <0x697>
 <1><71b>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <71c>   DW_AT_byte_size   : 4
    <71c>   DW_AT_type        : <0x716>
 <1><720>: Abbrev Number: 11 (DW_TAG_typedef)
    <721>   DW_AT_name        : (indirect string, offset: 0x1116de): TX_TIMER_INTERNAL
    <725>   DW_AT_decl_file   : 4
    <726>   DW_AT_decl_line   : 395
    <728>   DW_AT_decl_column : 3
    <729>   DW_AT_type        : <0x697>
 <1><72d>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <72e>   DW_AT_byte_size   : 4
    <72e>   DW_AT_type        : <0x667>
 <1><732>: Abbrev Number: 14 (DW_TAG_structure_type)
    <733>   DW_AT_name        : (indirect string, offset: 0x10b316): TX_THREAD_STRUCT
    <737>   DW_AT_byte_size   : 176
    <738>   DW_AT_decl_file   : 4
    <738>   DW_AT_decl_line   : 454
    <73a>   DW_AT_decl_column : 16
    <73a>   DW_AT_sibling     : <0x953>
 <2><73e>: Abbrev Number: 1 (DW_TAG_member)
    <73f>   DW_AT_name        : (indirect string, offset: 0xe1a04): tx_thread_id
    <743>   DW_AT_decl_file   : 4
    <744>   DW_AT_decl_line   : 461
    <746>   DW_AT_decl_column : 25
    <747>   DW_AT_type        : <0x68b>
    <74b>   DW_AT_data_member_location: 0
 <2><74c>: Abbrev Number: 1 (DW_TAG_member)
    <74d>   DW_AT_name        : (indirect string, offset: 0x135fc9): tx_thread_run_count
    <751>   DW_AT_decl_file   : 4
    <752>   DW_AT_decl_line   : 462
    <754>   DW_AT_decl_column : 25
    <755>   DW_AT_type        : <0x68b>
    <759>   DW_AT_data_member_location: 4
 <2><75a>: Abbrev Number: 1 (DW_TAG_member)
    <75b>   DW_AT_name        : (indirect string, offset: 0x120c2d): tx_thread_stack_ptr
    <75f>   DW_AT_decl_file   : 4
    <760>   DW_AT_decl_line   : 463
    <762>   DW_AT_decl_column : 26
    <763>   DW_AT_type        : <0x654>
    <767>   DW_AT_data_member_location: 8
 <2><768>: Abbrev Number: 1 (DW_TAG_member)
    <769>   DW_AT_name        : (indirect string, offset: 0xffe6): tx_thread_stack_start
    <76d>   DW_AT_decl_file   : 4
    <76e>   DW_AT_decl_line   : 464
    <770>   DW_AT_decl_column : 26
    <771>   DW_AT_type        : <0x654>
    <775>   DW_AT_data_member_location: 12
 <2><776>: Abbrev Number: 1 (DW_TAG_member)
    <777>   DW_AT_name        : (indirect string, offset: 0x300bb): tx_thread_stack_end
    <77b>   DW_AT_decl_file   : 4
    <77c>   DW_AT_decl_line   : 465
    <77e>   DW_AT_decl_column : 26
    <77f>   DW_AT_type        : <0x654>
    <783>   DW_AT_data_member_location: 16
 <2><784>: Abbrev Number: 1 (DW_TAG_member)
    <785>   DW_AT_name        : (indirect string, offset: 0x2da90): tx_thread_stack_size
    <789>   DW_AT_decl_file   : 4
    <78a>   DW_AT_decl_line   : 466
    <78c>   DW_AT_decl_column : 25
    <78d>   DW_AT_type        : <0x68b>
    <791>   DW_AT_data_member_location: 20
 <2><792>: Abbrev Number: 1 (DW_TAG_member)
    <793>   DW_AT_name        : (indirect string, offset: 0x14c095): tx_thread_time_slice
    <797>   DW_AT_decl_file   : 4
    <798>   DW_AT_decl_line   : 467
    <79a>   DW_AT_decl_column : 25
    <79b>   DW_AT_type        : <0x68b>
    <79f>   DW_AT_data_member_location: 24
 <2><7a0>: Abbrev Number: 1 (DW_TAG_member)
    <7a1>   DW_AT_name        : (indirect string, offset: 0xfbe6f): tx_thread_new_time_slice
    <7a5>   DW_AT_decl_file   : 4
    <7a6>   DW_AT_decl_line   : 468
    <7a8>   DW_AT_decl_column : 25
    <7a9>   DW_AT_type        : <0x68b>
    <7ad>   DW_AT_data_member_location: 28
 <2><7ae>: Abbrev Number: 1 (DW_TAG_member)
    <7af>   DW_AT_name        : (indirect string, offset: 0x88096): tx_thread_ready_next
    <7b3>   DW_AT_decl_file   : 4
    <7b4>   DW_AT_decl_line   : 472
    <7b6>   DW_AT_decl_column : 26
    <7b7>   DW_AT_type        : <0x953>
    <7bb>   DW_AT_data_member_location: 32
 <2><7bc>: Abbrev Number: 1 (DW_TAG_member)
    <7bd>   DW_AT_name        : (indirect string, offset: 0xeb53c): tx_thread_ready_previous
    <7c1>   DW_AT_decl_file   : 4
    <7c2>   DW_AT_decl_line   : 473
    <7c4>   DW_AT_decl_column : 26
    <7c5>   DW_AT_type        : <0x953>
    <7c9>   DW_AT_data_member_location: 36
 <2><7ca>: Abbrev Number: 1 (DW_TAG_member)
    <7cb>   DW_AT_name        : (indirect string, offset: 0x1b4dd): tx_thread_name
    <7cf>   DW_AT_decl_file   : 4
    <7d0>   DW_AT_decl_line   : 481
    <7d2>   DW_AT_decl_column : 26
    <7d3>   DW_AT_type        : <0x72d>
    <7d7>   DW_AT_data_member_location: 40
 <2><7d8>: Abbrev Number: 1 (DW_TAG_member)
    <7d9>   DW_AT_name        : (indirect string, offset: 0x484df): tx_thread_priority
    <7dd>   DW_AT_decl_file   : 4
    <7de>   DW_AT_decl_line   : 482
    <7e0>   DW_AT_decl_column : 25
    <7e1>   DW_AT_type        : <0x673>
    <7e5>   DW_AT_data_member_location: 44
 <2><7e6>: Abbrev Number: 1 (DW_TAG_member)
    <7e7>   DW_AT_name        : (indirect string, offset: 0xff5b4): tx_thread_state
    <7eb>   DW_AT_decl_file   : 4
    <7ec>   DW_AT_decl_line   : 483
    <7ee>   DW_AT_decl_column : 25
    <7ef>   DW_AT_type        : <0x673>
    <7f3>   DW_AT_data_member_location: 48
 <2><7f4>: Abbrev Number: 1 (DW_TAG_member)
    <7f5>   DW_AT_name        : (indirect string, offset: 0x10980f): tx_thread_delayed_suspend
    <7f9>   DW_AT_decl_file   : 4
    <7fa>   DW_AT_decl_line   : 484
    <7fc>   DW_AT_decl_column : 25
    <7fd>   DW_AT_type        : <0x673>
    <801>   DW_AT_data_member_location: 52
 <2><802>: Abbrev Number: 1 (DW_TAG_member)
    <803>   DW_AT_name        : (indirect string, offset: 0xf9ab4): tx_thread_suspending
    <807>   DW_AT_decl_file   : 4
    <808>   DW_AT_decl_line   : 485
    <80a>   DW_AT_decl_column : 25
    <80b>   DW_AT_type        : <0x673>
    <80f>   DW_AT_data_member_location: 56
 <2><810>: Abbrev Number: 1 (DW_TAG_member)
    <811>   DW_AT_name        : (indirect string, offset: 0xece06): tx_thread_preempt_threshold
    <815>   DW_AT_decl_file   : 4
    <816>   DW_AT_decl_line   : 486
    <818>   DW_AT_decl_column : 25
    <819>   DW_AT_type        : <0x673>
    <81d>   DW_AT_data_member_location: 60
 <2><81e>: Abbrev Number: 1 (DW_TAG_member)
    <81f>   DW_AT_name        : (indirect string, offset: 0xaa27): tx_thread_schedule_hook
    <823>   DW_AT_decl_file   : 4
    <824>   DW_AT_decl_line   : 491
    <826>   DW_AT_decl_column : 27
    <827>   DW_AT_type        : <0x968>
    <82b>   DW_AT_data_member_location: 64
 <2><82c>: Abbrev Number: 1 (DW_TAG_member)
    <82d>   DW_AT_name        : (indirect string, offset: 0x1088d7): tx_thread_entry
    <831>   DW_AT_decl_file   : 4
    <832>   DW_AT_decl_line   : 499
    <834>   DW_AT_decl_column : 27
    <835>   DW_AT_type        : <0x711>
    <839>   DW_AT_data_member_location: 68
 <2><83a>: Abbrev Number: 1 (DW_TAG_member)
    <83b>   DW_AT_name        : (indirect string, offset: 0x50abc): tx_thread_entry_parameter
    <83f>   DW_AT_decl_file   : 4
    <840>   DW_AT_decl_line   : 500
    <842>   DW_AT_decl_column : 25
    <843>   DW_AT_type        : <0x68b>
    <847>   DW_AT_data_member_location: 72
 <2><848>: Abbrev Number: 1 (DW_TAG_member)
    <849>   DW_AT_name        : (indirect string, offset: 0xd3df6): tx_thread_timer
    <84d>   DW_AT_decl_file   : 4
    <84e>   DW_AT_decl_line   : 504
    <850>   DW_AT_decl_column : 25
    <851>   DW_AT_type        : <0x720>
    <855>   DW_AT_data_member_location: 76
 <2><856>: Abbrev Number: 1 (DW_TAG_member)
    <857>   DW_AT_name        : (indirect string, offset: 0xf1c05): tx_thread_suspend_cleanup
    <85b>   DW_AT_decl_file   : 4
    <85c>   DW_AT_decl_line   : 510
    <85e>   DW_AT_decl_column : 27
    <85f>   DW_AT_type        : <0x968>
    <863>   DW_AT_data_member_location: 104
 <2><864>: Abbrev Number: 1 (DW_TAG_member)
    <865>   DW_AT_name        : (indirect string, offset: 0xce875): tx_thread_suspend_control_block
    <869>   DW_AT_decl_file   : 4
    <86a>   DW_AT_decl_line   : 511
    <86c>   DW_AT_decl_column : 26
    <86d>   DW_AT_type        : <0x654>
    <871>   DW_AT_data_member_location: 108
 <2><872>: Abbrev Number: 1 (DW_TAG_member)
    <873>   DW_AT_name        : (indirect string, offset: 0x33ebc): tx_thread_suspended_next
    <877>   DW_AT_decl_file   : 4
    <878>   DW_AT_decl_line   : 513
    <87a>   DW_AT_decl_column : 26
    <87b>   DW_AT_type        : <0x953>
    <87f>   DW_AT_data_member_location: 112
 <2><880>: Abbrev Number: 1 (DW_TAG_member)
    <881>   DW_AT_name        : (indirect string, offset: 0x7028f): tx_thread_suspended_previous
    <885>   DW_AT_decl_file   : 4
    <886>   DW_AT_decl_line   : 514
    <888>   DW_AT_decl_column : 26
    <889>   DW_AT_type        : <0x953>
    <88d>   DW_AT_data_member_location: 116
 <2><88e>: Abbrev Number: 1 (DW_TAG_member)
    <88f>   DW_AT_name        : (indirect string, offset: 0x92b42): tx_thread_suspend_info
    <893>   DW_AT_decl_file   : 4
    <894>   DW_AT_decl_line   : 515
    <896>   DW_AT_decl_column : 25
    <897>   DW_AT_type        : <0x68b>
    <89b>   DW_AT_data_member_location: 120
 <2><89c>: Abbrev Number: 1 (DW_TAG_member)
    <89d>   DW_AT_name        : (indirect string, offset: 0x9388f): tx_thread_additional_suspend_info
    <8a1>   DW_AT_decl_file   : 4
    <8a2>   DW_AT_decl_line   : 516
    <8a4>   DW_AT_decl_column : 26
    <8a5>   DW_AT_type        : <0x654>
    <8a9>   DW_AT_data_member_location: 124
 <2><8aa>: Abbrev Number: 1 (DW_TAG_member)
    <8ab>   DW_AT_name        : (indirect string, offset: 0xdee05): tx_thread_suspend_option
    <8af>   DW_AT_decl_file   : 4
    <8b0>   DW_AT_decl_line   : 517
    <8b2>   DW_AT_decl_column : 25
    <8b3>   DW_AT_type        : <0x673>
    <8b7>   DW_AT_data_member_location: 128
 <2><8b8>: Abbrev Number: 1 (DW_TAG_member)
    <8b9>   DW_AT_name        : (indirect string, offset: 0x833d9): tx_thread_suspend_status
    <8bd>   DW_AT_decl_file   : 4
    <8be>   DW_AT_decl_line   : 518
    <8c0>   DW_AT_decl_column : 25
    <8c1>   DW_AT_type        : <0x673>
    <8c5>   DW_AT_data_member_location: 132
 <2><8c6>: Abbrev Number: 1 (DW_TAG_member)
    <8c7>   DW_AT_name        : (indirect string, offset: 0x456f5): tx_thread_created_next
    <8cb>   DW_AT_decl_file   : 4
    <8cc>   DW_AT_decl_line   : 527
    <8ce>   DW_AT_decl_column : 26
    <8cf>   DW_AT_type        : <0x953>
    <8d3>   DW_AT_data_member_location: 136
 <2><8d4>: Abbrev Number: 1 (DW_TAG_member)
    <8d5>   DW_AT_name        : (indirect string, offset: 0x5a4bb): tx_thread_created_previous
    <8d9>   DW_AT_decl_file   : 4
    <8da>   DW_AT_decl_line   : 528
    <8dc>   DW_AT_decl_column : 26
    <8dd>   DW_AT_type        : <0x953>
    <8e1>   DW_AT_data_member_location: 140
 <2><8e2>: Abbrev Number: 1 (DW_TAG_member)
    <8e3>   DW_AT_name        : (indirect string, offset: 0x3a2c7): tx_thread_filex_ptr
    <8e7>   DW_AT_decl_file   : 4
    <8e8>   DW_AT_decl_line   : 536
    <8ea>   DW_AT_decl_column : 26
    <8eb>   DW_AT_type        : <0x654>
    <8ef>   DW_AT_data_member_location: 144
 <2><8f0>: Abbrev Number: 1 (DW_TAG_member)
    <8f1>   DW_AT_name        : (indirect string, offset: 0x3d042): tx_thread_user_priority
    <8f5>   DW_AT_decl_file   : 4
    <8f6>   DW_AT_decl_line   : 542
    <8f8>   DW_AT_decl_column : 25
    <8f9>   DW_AT_type        : <0x673>
    <8fd>   DW_AT_data_member_location: 148
 <2><8fe>: Abbrev Number: 1 (DW_TAG_member)
    <8ff>   DW_AT_name        : (indirect string, offset: 0x76622): tx_thread_user_preempt_threshold
    <903>   DW_AT_decl_file   : 4
    <904>   DW_AT_decl_line   : 543
    <906>   DW_AT_decl_column : 25
    <907>   DW_AT_type        : <0x673>
    <90b>   DW_AT_data_member_location: 152
 <2><90c>: Abbrev Number: 1 (DW_TAG_member)
    <90d>   DW_AT_name        : (indirect string, offset: 0x942ec): tx_thread_inherit_priority
    <911>   DW_AT_decl_file   : 4
    <912>   DW_AT_decl_line   : 544
    <914>   DW_AT_decl_column : 25
    <915>   DW_AT_type        : <0x673>
    <919>   DW_AT_data_member_location: 156
 <2><91a>: Abbrev Number: 1 (DW_TAG_member)
    <91b>   DW_AT_name        : (indirect string, offset: 0x73d50): tx_thread_owned_mutex_count
    <91f>   DW_AT_decl_file   : 4
    <920>   DW_AT_decl_line   : 547
    <922>   DW_AT_decl_column : 25
    <923>   DW_AT_type        : <0x673>
    <927>   DW_AT_data_member_location: 160
 <2><928>: Abbrev Number: 1 (DW_TAG_member)
    <929>   DW_AT_name        : (indirect string, offset: 0xefe24): tx_thread_owned_mutex_list
    <92d>   DW_AT_decl_file   : 4
    <92e>   DW_AT_decl_line   : 549
    <930>   DW_AT_decl_column : 26
    <931>   DW_AT_type        : <0xa30>
    <935>   DW_AT_data_member_location: 164
 <2><936>: Abbrev Number: 1 (DW_TAG_member)
    <937>   DW_AT_name        : (indirect string, offset: 0xad39c): tx_thread_stack_highest_ptr
    <93b>   DW_AT_decl_file   : 4
    <93c>   DW_AT_decl_line   : 589
    <93e>   DW_AT_decl_column : 26
    <93f>   DW_AT_type        : <0x654>
    <943>   DW_AT_data_member_location: 168
 <2><944>: Abbrev Number: 1 (DW_TAG_member)
    <945>   DW_AT_name        : (indirect string, offset: 0x13d31e): tx_thread_suspension_sequence
    <949>   DW_AT_decl_file   : 4
    <94a>   DW_AT_decl_line   : 616
    <94c>   DW_AT_decl_column : 25
    <94d>   DW_AT_type        : <0x68b>
    <951>   DW_AT_data_member_location: 172
 <2><952>: Abbrev Number: 0
 <1><953>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <954>   DW_AT_byte_size   : 4
    <954>   DW_AT_type        : <0x732>
 <1><958>: Abbrev Number: 19 (DW_TAG_subroutine_type)
    <959>   DW_AT_prototyped  : 1
    <959>   DW_AT_sibling     : <0x968>
 <2><95d>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <95e>   DW_AT_type        : <0x953>
 <2><962>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <963>   DW_AT_type        : <0x68b>
 <2><967>: Abbrev Number: 0
 <1><968>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <969>   DW_AT_byte_size   : 4
    <969>   DW_AT_type        : <0x958>
 <1><96d>: Abbrev Number: 14 (DW_TAG_structure_type)
    <96e>   DW_AT_name        : (indirect string, offset: 0xe2bc7): TX_MUTEX_STRUCT
    <972>   DW_AT_byte_size   : 52
    <973>   DW_AT_decl_file   : 4
    <973>   DW_AT_decl_line   : 872
    <975>   DW_AT_decl_column : 16
    <975>   DW_AT_sibling     : <0xa30>
 <2><979>: Abbrev Number: 1 (DW_TAG_member)
    <97a>   DW_AT_name        : (indirect string, offset: 0x3f197): tx_mutex_id
    <97e>   DW_AT_decl_file   : 4
    <97f>   DW_AT_decl_line   : 876
    <981>   DW_AT_decl_column : 25
    <982>   DW_AT_type        : <0x68b>
    <986>   DW_AT_data_member_location: 0
 <2><987>: Abbrev Number: 1 (DW_TAG_member)
    <988>   DW_AT_name        : (indirect string, offset: 0x9793d): tx_mutex_name
    <98c>   DW_AT_decl_file   : 4
    <98d>   DW_AT_decl_line   : 879
    <98f>   DW_AT_decl_column : 26
    <990>   DW_AT_type        : <0x72d>
    <994>   DW_AT_data_member_location: 4
 <2><995>: Abbrev Number: 1 (DW_TAG_member)
    <996>   DW_AT_name        : (indirect string, offset: 0x8fc04): tx_mutex_ownership_count
    <99a>   DW_AT_decl_file   : 4
    <99b>   DW_AT_decl_line   : 882
    <99d>   DW_AT_decl_column : 25
    <99e>   DW_AT_type        : <0x673>
    <9a2>   DW_AT_data_member_location: 8
 <2><9a3>: Abbrev Number: 1 (DW_TAG_member)
    <9a4>   DW_AT_name        : (indirect string, offset: 0x86bcc): tx_mutex_owner
    <9a8>   DW_AT_decl_file   : 4
    <9a9>   DW_AT_decl_line   : 886
    <9ab>   DW_AT_decl_column : 26
    <9ac>   DW_AT_type        : <0xa42>
    <9b0>   DW_AT_data_member_location: 12
 <2><9b1>: Abbrev Number: 1 (DW_TAG_member)
    <9b2>   DW_AT_name        : (indirect string, offset: 0x4e4eb): tx_mutex_inherit
    <9b6>   DW_AT_decl_file   : 4
    <9b7>   DW_AT_decl_line   : 890
    <9b9>   DW_AT_decl_column : 25
    <9ba>   DW_AT_type        : <0x673>
    <9be>   DW_AT_data_member_location: 16
 <2><9bf>: Abbrev Number: 1 (DW_TAG_member)
    <9c0>   DW_AT_name        : (indirect string, offset: 0x7b9ec): tx_mutex_original_priority
    <9c4>   DW_AT_decl_file   : 4
    <9c5>   DW_AT_decl_line   : 893
    <9c7>   DW_AT_decl_column : 25
    <9c8>   DW_AT_type        : <0x673>
    <9cc>   DW_AT_data_member_location: 20
 <2><9cd>: Abbrev Number: 1 (DW_TAG_member)
    <9ce>   DW_AT_name        : (indirect string, offset: 0x79dca): tx_mutex_suspension_list
    <9d2>   DW_AT_decl_file   : 4
    <9d3>   DW_AT_decl_line   : 898
    <9d5>   DW_AT_decl_column : 26
    <9d6>   DW_AT_type        : <0x953>
    <9da>   DW_AT_data_member_location: 24
 <2><9db>: Abbrev Number: 1 (DW_TAG_member)
    <9dc>   DW_AT_name        : (indirect string, offset: 0x7165d): tx_mutex_suspended_count
    <9e0>   DW_AT_decl_file   : 4
    <9e1>   DW_AT_decl_line   : 899
    <9e3>   DW_AT_decl_column : 25
    <9e4>   DW_AT_type        : <0x673>
    <9e8>   DW_AT_data_member_location: 28
 <2><9e9>: Abbrev Number: 1 (DW_TAG_member)
    <9ea>   DW_AT_name        : (indirect string, offset: 0x112efb): tx_mutex_created_next
    <9ee>   DW_AT_decl_file   : 4
    <9ef>   DW_AT_decl_line   : 903
    <9f1>   DW_AT_decl_column : 26
    <9f2>   DW_AT_type        : <0xa30>
    <9f6>   DW_AT_data_member_location: 32
 <2><9f7>: Abbrev Number: 1 (DW_TAG_member)
    <9f8>   DW_AT_name        : (indirect string, offset: 0xc1734): tx_mutex_created_previous
    <9fc>   DW_AT_decl_file   : 4
    <9fd>   DW_AT_decl_line   : 904
    <9ff>   DW_AT_decl_column : 26
    <a00>   DW_AT_type        : <0xa30>
    <a04>   DW_AT_data_member_location: 36
 <2><a05>: Abbrev Number: 1 (DW_TAG_member)
    <a06>   DW_AT_name        : (indirect string, offset: 0xc9da): tx_mutex_highest_priority_waiting
    <a0a>   DW_AT_decl_file   : 4
    <a0b>   DW_AT_decl_line   : 908
    <a0d>   DW_AT_decl_column : 25
    <a0e>   DW_AT_type        : <0x673>
    <a12>   DW_AT_data_member_location: 40
 <2><a13>: Abbrev Number: 1 (DW_TAG_member)
    <a14>   DW_AT_name        : (indirect string, offset: 0xe33bc): tx_mutex_owned_next
    <a18>   DW_AT_decl_file   : 4
    <a19>   DW_AT_decl_line   : 912
    <a1b>   DW_AT_decl_column : 26
    <a1c>   DW_AT_type        : <0xa30>
    <a20>   DW_AT_data_member_location: 44
 <2><a21>: Abbrev Number: 1 (DW_TAG_member)
    <a22>   DW_AT_name        : (indirect string, offset: 0x270c8): tx_mutex_owned_previous
    <a26>   DW_AT_decl_file   : 4
    <a27>   DW_AT_decl_line   : 913
    <a29>   DW_AT_decl_column : 26
    <a2a>   DW_AT_type        : <0xa30>
    <a2e>   DW_AT_data_member_location: 48
 <2><a2f>: Abbrev Number: 0
 <1><a30>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <a31>   DW_AT_byte_size   : 4
    <a31>   DW_AT_type        : <0x96d>
 <1><a35>: Abbrev Number: 11 (DW_TAG_typedef)
    <a36>   DW_AT_name        : (indirect string, offset: 0xfc0a6): TX_THREAD
    <a3a>   DW_AT_decl_file   : 4
    <a3b>   DW_AT_decl_line   : 624
    <a3d>   DW_AT_decl_column : 3
    <a3e>   DW_AT_type        : <0x732>
 <1><a42>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <a43>   DW_AT_byte_size   : 4
    <a43>   DW_AT_type        : <0xa35>
 <1><a47>: Abbrev Number: 14 (DW_TAG_structure_type)
    <a48>   DW_AT_name        : (indirect string, offset: 0x141215): TX_QUEUE_STRUCT
    <a4c>   DW_AT_byte_size   : 56
    <a4d>   DW_AT_decl_file   : 4
    <a4d>   DW_AT_decl_line   : 945
    <a4f>   DW_AT_decl_column : 16
    <a4f>   DW_AT_sibling     : <0xb18>
 <2><a53>: Abbrev Number: 1 (DW_TAG_member)
    <a54>   DW_AT_name        : (indirect string, offset: 0x140fc3): tx_queue_id
    <a58>   DW_AT_decl_file   : 4
    <a59>   DW_AT_decl_line   : 949
    <a5b>   DW_AT_decl_column : 25
    <a5c>   DW_AT_type        : <0x68b>
    <a60>   DW_AT_data_member_location: 0
 <2><a61>: Abbrev Number: 1 (DW_TAG_member)
    <a62>   DW_AT_name        : (indirect string, offset: 0x140768): tx_queue_name
    <a66>   DW_AT_decl_file   : 4
    <a67>   DW_AT_decl_line   : 952
    <a69>   DW_AT_decl_column : 26
    <a6a>   DW_AT_type        : <0x72d>
    <a6e>   DW_AT_data_member_location: 4
 <2><a6f>: Abbrev Number: 1 (DW_TAG_member)
    <a70>   DW_AT_name        : (indirect string, offset: 0x1415d7): tx_queue_message_size
    <a74>   DW_AT_decl_file   : 4
    <a75>   DW_AT_decl_line   : 955
    <a77>   DW_AT_decl_column : 25
    <a78>   DW_AT_type        : <0x673>
    <a7c>   DW_AT_data_member_location: 8
 <2><a7d>: Abbrev Number: 1 (DW_TAG_member)
    <a7e>   DW_AT_name        : (indirect string, offset: 0x140cc7): tx_queue_capacity
    <a82>   DW_AT_decl_file   : 4
    <a83>   DW_AT_decl_line   : 958
    <a85>   DW_AT_decl_column : 25
    <a86>   DW_AT_type        : <0x673>
    <a8a>   DW_AT_data_member_location: 12
 <2><a8b>: Abbrev Number: 1 (DW_TAG_member)
    <a8c>   DW_AT_name        : (indirect string, offset: 0x141192): tx_queue_enqueued
    <a90>   DW_AT_decl_file   : 4
    <a91>   DW_AT_decl_line   : 962
    <a93>   DW_AT_decl_column : 25
    <a94>   DW_AT_type        : <0x673>
    <a98>   DW_AT_data_member_location: 16
 <2><a99>: Abbrev Number: 1 (DW_TAG_member)
    <a9a>   DW_AT_name        : (indirect string, offset: 0x140a06): tx_queue_available_storage
    <a9e>   DW_AT_decl_file   : 4
    <a9f>   DW_AT_decl_line   : 963
    <aa1>   DW_AT_decl_column : 25
    <aa2>   DW_AT_type        : <0x673>
    <aa6>   DW_AT_data_member_location: 20
 <2><aa7>: Abbrev Number: 1 (DW_TAG_member)
    <aa8>   DW_AT_name        : (indirect string, offset: 0x1415c8): tx_queue_start
    <aac>   DW_AT_decl_file   : 4
    <aad>   DW_AT_decl_line   : 967
    <aaf>   DW_AT_decl_column : 26
    <ab0>   DW_AT_type        : <0xb18>
    <ab4>   DW_AT_data_member_location: 24
 <2><ab5>: Abbrev Number: 1 (DW_TAG_member)
    <ab6>   DW_AT_name        : (indirect string, offset: 0x140bd2): tx_queue_end
    <aba>   DW_AT_decl_file   : 4
    <abb>   DW_AT_decl_line   : 968
    <abd>   DW_AT_decl_column : 26
    <abe>   DW_AT_type        : <0xb18>
    <ac2>   DW_AT_data_member_location: 28
 <2><ac3>: Abbrev Number: 1 (DW_TAG_member)
    <ac4>   DW_AT_name        : (indirect string, offset: 0x140f10): tx_queue_read
    <ac8>   DW_AT_decl_file   : 4
    <ac9>   DW_AT_decl_line   : 972
    <acb>   DW_AT_decl_column : 26
    <acc>   DW_AT_type        : <0xb18>
    <ad0>   DW_AT_data_member_location: 32
 <2><ad1>: Abbrev Number: 1 (DW_TAG_member)
    <ad2>   DW_AT_name        : (indirect string, offset: 0x140e9c): tx_queue_write
    <ad6>   DW_AT_decl_file   : 4
    <ad7>   DW_AT_decl_line   : 973
    <ad9>   DW_AT_decl_column : 26
    <ada>   DW_AT_type        : <0xb18>
    <ade>   DW_AT_data_member_location: 36
 <2><adf>: Abbrev Number: 1 (DW_TAG_member)
    <ae0>   DW_AT_name        : (indirect string, offset: 0x14153e): tx_queue_suspension_list
    <ae4>   DW_AT_decl_file   : 4
    <ae5>   DW_AT_decl_line   : 978
    <ae7>   DW_AT_decl_column : 26
    <ae8>   DW_AT_type        : <0x953>
    <aec>   DW_AT_data_member_location: 40
 <2><aed>: Abbrev Number: 1 (DW_TAG_member)
    <aee>   DW_AT_name        : (indirect string, offset: 0x14143b): tx_queue_suspended_count
    <af2>   DW_AT_decl_file   : 4
    <af3>   DW_AT_decl_line   : 979
    <af5>   DW_AT_decl_column : 25
    <af6>   DW_AT_type        : <0x673>
    <afa>   DW_AT_data_member_location: 44
 <2><afb>: Abbrev Number: 1 (DW_TAG_member)
    <afc>   DW_AT_name        : (indirect string, offset: 0x140e19): tx_queue_created_next
    <b00>   DW_AT_decl_file   : 4
    <b01>   DW_AT_decl_line   : 983
    <b03>   DW_AT_decl_column : 26
    <b04>   DW_AT_type        : <0xb1d>
    <b08>   DW_AT_data_member_location: 48
 <2><b09>: Abbrev Number: 1 (DW_TAG_member)
    <b0a>   DW_AT_name        : (indirect string, offset: 0x14150a): tx_queue_created_previous
    <b0e>   DW_AT_decl_file   : 4
    <b0f>   DW_AT_decl_line   : 984
    <b11>   DW_AT_decl_column : 26
    <b12>   DW_AT_type        : <0xb1d>
    <b16>   DW_AT_data_member_location: 52
 <2><b17>: Abbrev Number: 0
 <1><b18>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <b19>   DW_AT_byte_size   : 4
    <b19>   DW_AT_type        : <0x68b>
 <1><b1d>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <b1e>   DW_AT_byte_size   : 4
    <b1e>   DW_AT_type        : <0xa47>
 <1><b22>: Abbrev Number: 11 (DW_TAG_typedef)
    <b23>   DW_AT_name        : (indirect string, offset: 0x14179a): TX_QUEUE
    <b27>   DW_AT_decl_file   : 4
    <b28>   DW_AT_decl_line   : 1019
    <b2a>   DW_AT_decl_column : 3
    <b2b>   DW_AT_type        : <0xa47>
 <1><b2f>: Abbrev Number: 14 (DW_TAG_structure_type)
    <b30>   DW_AT_name        : (indirect string, offset: 0x140a7e): TX_SEMAPHORE_STRUCT
    <b34>   DW_AT_byte_size   : 28
    <b35>   DW_AT_decl_file   : 4
    <b35>   DW_AT_decl_line   : 1024
    <b37>   DW_AT_decl_column : 16
    <b37>   DW_AT_sibling     : <0xb9e>
 <2><b3b>: Abbrev Number: 1 (DW_TAG_member)
    <b3c>   DW_AT_name        : (indirect string, offset: 0x14124e): tx_semaphore_id
    <b40>   DW_AT_decl_file   : 4
    <b41>   DW_AT_decl_line   : 1028
    <b43>   DW_AT_decl_column : 25
    <b44>   DW_AT_type        : <0x68b>
    <b48>   DW_AT_data_member_location: 0
 <2><b49>: Abbrev Number: 1 (DW_TAG_member)
    <b4a>   DW_AT_name        : (indirect string, offset: 0x1409d6): tx_semaphore_name
    <b4e>   DW_AT_decl_file   : 4
    <b4f>   DW_AT_decl_line   : 1031
    <b51>   DW_AT_decl_column : 26
    <b52>   DW_AT_type        : <0x72d>
    <b56>   DW_AT_data_member_location: 4
 <2><b57>: Abbrev Number: 1 (DW_TAG_member)
    <b58>   DW_AT_name        : (indirect string, offset: 0x141157): tx_semaphore_count
    <b5c>   DW_AT_decl_file   : 4
    <b5d>   DW_AT_decl_line   : 1035
    <b5f>   DW_AT_decl_column : 25
    <b60>   DW_AT_type        : <0x68b>
    <b64>   DW_AT_data_member_location: 8
 <2><b65>: Abbrev Number: 1 (DW_TAG_member)
    <b66>   DW_AT_name        : (indirect string, offset: 0x140ad2): tx_semaphore_suspension_list
    <b6a>   DW_AT_decl_file   : 4
    <b6b>   DW_AT_decl_line   : 1040
    <b6d>   DW_AT_decl_column : 26
    <b6e>   DW_AT_type        : <0x953>
    <b72>   DW_AT_data_member_location: 12
 <2><b73>: Abbrev Number: 1 (DW_TAG_member)
    <b74>   DW_AT_name        : (indirect string, offset: 0x1412ac): tx_semaphore_suspended_count
    <b78>   DW_AT_decl_file   : 4
    <b79>   DW_AT_decl_line   : 1041
    <b7b>   DW_AT_decl_column : 25
    <b7c>   DW_AT_type        : <0x673>
    <b80>   DW_AT_data_member_location: 16
 <2><b81>: Abbrev Number: 1 (DW_TAG_member)
    <b82>   DW_AT_name        : (indirect string, offset: 0x141178): tx_semaphore_created_next
    <b86>   DW_AT_decl_file   : 4
    <b87>   DW_AT_decl_line   : 1045
    <b89>   DW_AT_decl_column : 26
    <b8a>   DW_AT_type        : <0xb9e>
    <b8e>   DW_AT_data_member_location: 20
 <2><b8f>: Abbrev Number: 1 (DW_TAG_member)
    <b90>   DW_AT_name        : (indirect string, offset: 0x14053e): tx_semaphore_created_previous
    <b94>   DW_AT_decl_file   : 4
    <b95>   DW_AT_decl_line   : 1046
    <b97>   DW_AT_decl_column : 26
    <b98>   DW_AT_type        : <0xb9e>
    <b9c>   DW_AT_data_member_location: 24
 <2><b9d>: Abbrev Number: 0
 <1><b9e>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <b9f>   DW_AT_byte_size   : 4
    <b9f>   DW_AT_type        : <0xb2f>
 <1><ba3>: Abbrev Number: 11 (DW_TAG_typedef)
    <ba4>   DW_AT_name        : (indirect string, offset: 0x1408d6): TX_SEMAPHORE
    <ba8>   DW_AT_decl_file   : 4
    <ba9>   DW_AT_decl_line   : 1074
    <bab>   DW_AT_decl_column : 3
    <bac>   DW_AT_type        : <0xb2f>
 <1><bb0>: Abbrev Number: 6 (DW_TAG_base_type)
    <bb1>   DW_AT_byte_size   : 4
    <bb2>   DW_AT_encoding    : 4	(float)
    <bb3>   DW_AT_name        : (indirect string, offset: 0x6aff3): float
 <1><bb7>: Abbrev Number: 6 (DW_TAG_base_type)
    <bb8>   DW_AT_byte_size   : 8
    <bb9>   DW_AT_encoding    : 4	(float)
    <bba>   DW_AT_name        : (indirect string, offset: 0x75191): double
 <1><bbe>: Abbrev Number: 4 (DW_TAG_typedef)
    <bbf>   DW_AT_name        : (indirect string, offset: 0x141000): uint8_t
    <bc3>   DW_AT_decl_file   : 5
    <bc4>   DW_AT_decl_line   : 24
    <bc5>   DW_AT_decl_column : 19
    <bc6>   DW_AT_type        : <0x5fa>
 <1><bca>: Abbrev Number: 4 (DW_TAG_typedef)
    <bcb>   DW_AT_name        : (indirect string, offset: 0x140577): uint16_t
    <bcf>   DW_AT_decl_file   : 5
    <bd0>   DW_AT_decl_line   : 36
    <bd1>   DW_AT_decl_column : 20
    <bd2>   DW_AT_type        : <0x614>
 <1><bd6>: Abbrev Number: 4 (DW_TAG_typedef)
    <bd7>   DW_AT_name        : (indirect string, offset: 0x140eef): int32_t
    <bdb>   DW_AT_decl_file   : 5
    <bdc>   DW_AT_decl_line   : 44
    <bdd>   DW_AT_decl_column : 19
    <bde>   DW_AT_type        : <0x627>
 <1><be2>: Abbrev Number: 4 (DW_TAG_typedef)
    <be3>   DW_AT_name        : (indirect string, offset: 0x14065f): uint32_t
    <be7>   DW_AT_decl_file   : 5
    <be8>   DW_AT_decl_line   : 48
    <be9>   DW_AT_decl_column : 20
    <bea>   DW_AT_type        : <0x63a>
 <1><bee>: Abbrev Number: 17 (DW_TAG_volatile_type)
    <bef>   DW_AT_type        : <0xbe2>
 <1><bf3>: Abbrev Number: 18 (DW_TAG_array_type)
    <bf4>   DW_AT_type        : <0xbee>
    <bf8>   DW_AT_sibling     : <0xc03>
 <2><bfc>: Abbrev Number: 20 (DW_TAG_subrange_type)
    <bfd>   DW_AT_type        : <0x5d7>
    <c01>   DW_AT_upper_bound : 1
 <2><c02>: Abbrev Number: 0
 <1><c03>: Abbrev Number: 17 (DW_TAG_volatile_type)
    <c04>   DW_AT_type        : <0xbf3>
 <1><c08>: Abbrev Number: 21 (DW_TAG_structure_type)
    <c09>   DW_AT_byte_size   : 52
    <c0a>   DW_AT_decl_file   : 6
    <c0a>   DW_AT_decl_line   : 812
    <c0c>   DW_AT_decl_column : 9
    <c0c>   DW_AT_sibling     : <0xcb1>
 <2><c10>: Abbrev Number: 1 (DW_TAG_member)
    <c11>   DW_AT_name        : (indirect string, offset: 0x1416f8): MODER
    <c15>   DW_AT_decl_file   : 6
    <c16>   DW_AT_decl_line   : 814
    <c18>   DW_AT_decl_column : 17
    <c19>   DW_AT_type        : <0xbee>
    <c1d>   DW_AT_data_member_location: 0
 <2><c1e>: Abbrev Number: 1 (DW_TAG_member)
    <c1f>   DW_AT_name        : (indirect string, offset: 0x140c0c): OTYPER
    <c23>   DW_AT_decl_file   : 6
    <c24>   DW_AT_decl_line   : 815
    <c26>   DW_AT_decl_column : 17
    <c27>   DW_AT_type        : <0xbee>
    <c2b>   DW_AT_data_member_location: 4
 <2><c2c>: Abbrev Number: 1 (DW_TAG_member)
    <c2d>   DW_AT_name        : (indirect string, offset: 0x140613): OSPEEDR
    <c31>   DW_AT_decl_file   : 6
    <c32>   DW_AT_decl_line   : 816
    <c34>   DW_AT_decl_column : 17
    <c35>   DW_AT_type        : <0xbee>
    <c39>   DW_AT_data_member_location: 8
 <2><c3a>: Abbrev Number: 1 (DW_TAG_member)
    <c3b>   DW_AT_name        : (indirect string, offset: 0x141739): PUPDR
    <c3f>   DW_AT_decl_file   : 6
    <c40>   DW_AT_decl_line   : 817
    <c42>   DW_AT_decl_column : 17
    <c43>   DW_AT_type        : <0xbee>
    <c47>   DW_AT_data_member_location: 12
 <2><c48>: Abbrev Number: 10 (DW_TAG_member)
    <c49>   DW_AT_name        : IDR
    <c4d>   DW_AT_decl_file   : 6
    <c4d>   DW_AT_decl_line   : 818
    <c4f>   DW_AT_decl_column : 17
    <c4f>   DW_AT_type        : <0xbee>
    <c53>   DW_AT_data_member_location: 16
 <2><c54>: Abbrev Number: 10 (DW_TAG_member)
    <c55>   DW_AT_name        : ODR
    <c59>   DW_AT_decl_file   : 6
    <c59>   DW_AT_decl_line   : 819
    <c5b>   DW_AT_decl_column : 17
    <c5b>   DW_AT_type        : <0xbee>
    <c5f>   DW_AT_data_member_location: 20
 <2><c60>: Abbrev Number: 1 (DW_TAG_member)
    <c61>   DW_AT_name        : (indirect string, offset: 0x140851): BSRR
    <c65>   DW_AT_decl_file   : 6
    <c66>   DW_AT_decl_line   : 820
    <c68>   DW_AT_decl_column : 17
    <c69>   DW_AT_type        : <0xbee>
    <c6d>   DW_AT_data_member_location: 24
 <2><c6e>: Abbrev Number: 1 (DW_TAG_member)
    <c6f>   DW_AT_name        : (indirect string, offset: 0x1463e4): LCKR
    <c73>   DW_AT_decl_file   : 6
    <c74>   DW_AT_decl_line   : 821
    <c76>   DW_AT_decl_column : 17
    <c77>   DW_AT_type        : <0xbee>
    <c7b>   DW_AT_data_member_location: 28
 <2><c7c>: Abbrev Number: 10 (DW_TAG_member)
    <c7d>   DW_AT_name        : AFR
    <c81>   DW_AT_decl_file   : 6
    <c81>   DW_AT_decl_line   : 822
    <c83>   DW_AT_decl_column : 17
    <c83>   DW_AT_type        : <0xc03>
    <c87>   DW_AT_data_member_location: 32
 <2><c88>: Abbrev Number: 10 (DW_TAG_member)
    <c89>   DW_AT_name        : BRR
    <c8d>   DW_AT_decl_file   : 6
    <c8d>   DW_AT_decl_line   : 823
    <c8f>   DW_AT_decl_column : 17
    <c8f>   DW_AT_type        : <0xbee>
    <c93>   DW_AT_data_member_location: 40
 <2><c94>: Abbrev Number: 1 (DW_TAG_member)
    <c95>   DW_AT_name        : (indirect string, offset: 0x140708): HSLVR
    <c99>   DW_AT_decl_file   : 6
    <c9a>   DW_AT_decl_line   : 824
    <c9c>   DW_AT_decl_column : 17
    <c9d>   DW_AT_type        : <0xbee>
    <ca1>   DW_AT_data_member_location: 44
 <2><ca2>: Abbrev Number: 1 (DW_TAG_member)
    <ca3>   DW_AT_name        : (indirect string, offset: 0x140d7a): SECCFGR
    <ca7>   DW_AT_decl_file   : 6
    <ca8>   DW_AT_decl_line   : 825
    <caa>   DW_AT_decl_column : 17
    <cab>   DW_AT_type        : <0xbee>
    <caf>   DW_AT_data_member_location: 48
 <2><cb0>: Abbrev Number: 0
 <1><cb1>: Abbrev Number: 11 (DW_TAG_typedef)
    <cb2>   DW_AT_name        : (indirect string, offset: 0x140e70): GPIO_TypeDef
    <cb6>   DW_AT_decl_file   : 6
    <cb7>   DW_AT_decl_line   : 826
    <cb9>   DW_AT_decl_column : 3
    <cba>   DW_AT_type        : <0xc08>
 <1><cbe>: Abbrev Number: 21 (DW_TAG_structure_type)
    <cbf>   DW_AT_byte_size   : 48
    <cc0>   DW_AT_decl_file   : 6
    <cc0>   DW_AT_decl_line   : 1681
    <cc2>   DW_AT_decl_column : 9
    <cc2>   DW_AT_sibling     : <0xd66>
 <2><cc6>: Abbrev Number: 1 (DW_TAG_member)
    <cc7>   DW_AT_name        : (indirect string, offset: 0x146b6e): CFGR1
    <ccb>   DW_AT_decl_file   : 6
    <ccc>   DW_AT_decl_line   : 1683
    <cce>   DW_AT_decl_column : 17
    <ccf>   DW_AT_type        : <0xbee>
    <cd3>   DW_AT_data_member_location: 0
 <2><cd4>: Abbrev Number: 1 (DW_TAG_member)
    <cd5>   DW_AT_name        : (indirect string, offset: 0x140ba5): RESERVED0
    <cd9>   DW_AT_decl_file   : 6
    <cda>   DW_AT_decl_line   : 1684
    <cdc>   DW_AT_decl_column : 12
    <cdd>   DW_AT_type        : <0xbe2>
    <ce1>   DW_AT_data_member_location: 4
 <2><ce2>: Abbrev Number: 1 (DW_TAG_member)
    <ce3>   DW_AT_name        : (indirect string, offset: 0x140c3e): T0VALR1
    <ce7>   DW_AT_decl_file   : 6
    <ce8>   DW_AT_decl_line   : 1685
    <cea>   DW_AT_decl_column : 17
    <ceb>   DW_AT_type        : <0xbee>
    <cef>   DW_AT_data_member_location: 8
 <2><cf0>: Abbrev Number: 1 (DW_TAG_member)
    <cf1>   DW_AT_name        : (indirect string, offset: 0x140baf): RESERVED1
    <cf5>   DW_AT_decl_file   : 6
    <cf6>   DW_AT_decl_line   : 1686
    <cf8>   DW_AT_decl_column : 12
    <cf9>   DW_AT_type        : <0xbe2>
    <cfd>   DW_AT_data_member_location: 12
 <2><cfe>: Abbrev Number: 1 (DW_TAG_member)
    <cff>   DW_AT_name        : (indirect string, offset: 0x14113e): RAMPVALR
    <d03>   DW_AT_decl_file   : 6
    <d04>   DW_AT_decl_line   : 1687
    <d06>   DW_AT_decl_column : 17
    <d07>   DW_AT_type        : <0xbee>
    <d0b>   DW_AT_data_member_location: 16
 <2><d0c>: Abbrev Number: 1 (DW_TAG_member)
    <d0d>   DW_AT_name        : (indirect string, offset: 0xc5755): ITR1
    <d11>   DW_AT_decl_file   : 6
    <d12>   DW_AT_decl_line   : 1688
    <d14>   DW_AT_decl_column : 17
    <d15>   DW_AT_type        : <0xbee>
    <d19>   DW_AT_data_member_location: 20
 <2><d1a>: Abbrev Number: 1 (DW_TAG_member)
    <d1b>   DW_AT_name        : (indirect string, offset: 0x140f94): RESERVED2
    <d1f>   DW_AT_decl_file   : 6
    <d20>   DW_AT_decl_line   : 1689
    <d22>   DW_AT_decl_column : 12
    <d23>   DW_AT_type        : <0xbe2>
    <d27>   DW_AT_data_member_location: 24
 <2><d28>: Abbrev Number: 10 (DW_TAG_member)
    <d29>   DW_AT_name        : DR
    <d2c>   DW_AT_decl_file   : 6
    <d2c>   DW_AT_decl_line   : 1690
    <d2e>   DW_AT_decl_column : 17
    <d2e>   DW_AT_type        : <0xbee>
    <d32>   DW_AT_data_member_location: 28
 <2><d33>: Abbrev Number: 10 (DW_TAG_member)
    <d34>   DW_AT_name        : SR
    <d37>   DW_AT_decl_file   : 6
    <d37>   DW_AT_decl_line   : 1691
    <d39>   DW_AT_decl_column : 17
    <d39>   DW_AT_type        : <0xbee>
    <d3d>   DW_AT_data_member_location: 32
 <2><d3e>: Abbrev Number: 1 (DW_TAG_member)
    <d3f>   DW_AT_name        : (indirect string, offset: 0x140f1e): ITENR
    <d43>   DW_AT_decl_file   : 6
    <d44>   DW_AT_decl_line   : 1692
    <d46>   DW_AT_decl_column : 17
    <d47>   DW_AT_type        : <0xbee>
    <d4b>   DW_AT_data_member_location: 36
 <2><d4c>: Abbrev Number: 1 (DW_TAG_member)
    <d4d>   DW_AT_name        : (indirect string, offset: 0x1417b3): ICIFR
    <d51>   DW_AT_decl_file   : 6
    <d52>   DW_AT_decl_line   : 1693
    <d54>   DW_AT_decl_column : 17
    <d55>   DW_AT_type        : <0xbee>
    <d59>   DW_AT_data_member_location: 40
 <2><d5a>: Abbrev Number: 10 (DW_TAG_member)
    <d5b>   DW_AT_name        : OR
    <d5e>   DW_AT_decl_file   : 6
    <d5e>   DW_AT_decl_line   : 1694
    <d60>   DW_AT_decl_column : 17
    <d60>   DW_AT_type        : <0xbee>
    <d64>   DW_AT_data_member_location: 44
 <2><d65>: Abbrev Number: 0
 <1><d66>: Abbrev Number: 11 (DW_TAG_typedef)
    <d67>   DW_AT_name        : (indirect string, offset: 0x140f9e): DTS_TypeDef
    <d6b>   DW_AT_decl_file   : 6
    <d6c>   DW_AT_decl_line   : 1696
    <d6e>   DW_AT_decl_column : 1
    <d6f>   DW_AT_type        : <0xcbe>
 <1><d73>: Abbrev Number: 16 (DW_TAG_enumeration_type)
    <d74>   DW_AT_encoding    : 7	(unsigned)
    <d74>   DW_AT_byte_size   : 1
    <d74>   DW_AT_type        : <0x606>
    <d78>   DW_AT_decl_file   : 7
    <d79>   DW_AT_decl_line   : 44
    <d7a>   DW_AT_decl_column : 1
    <d7a>   DW_AT_sibling     : <0xd97>
 <2><d7e>: Abbrev Number: 7 (DW_TAG_enumerator)
    <d7f>   DW_AT_name        : (indirect string, offset: 0x1413ec): HAL_OK
    <d83>   DW_AT_const_value : 0
 <2><d84>: Abbrev Number: 7 (DW_TAG_enumerator)
    <d85>   DW_AT_name        : (indirect string, offset: 0x14086a): HAL_ERROR
    <d89>   DW_AT_const_value : 1
 <2><d8a>: Abbrev Number: 7 (DW_TAG_enumerator)
    <d8b>   DW_AT_name        : (indirect string, offset: 0x14068c): HAL_BUSY
    <d8f>   DW_AT_const_value : 2
 <2><d90>: Abbrev Number: 7 (DW_TAG_enumerator)
    <d91>   DW_AT_name        : (indirect string, offset: 0x14070e): HAL_TIMEOUT
    <d95>   DW_AT_const_value : 3
 <2><d96>: Abbrev Number: 0
 <1><d97>: Abbrev Number: 4 (DW_TAG_typedef)
    <d98>   DW_AT_name        : (indirect string, offset: 0x141405): HAL_StatusTypeDef
    <d9c>   DW_AT_decl_file   : 7
    <d9d>   DW_AT_decl_line   : 49
    <d9e>   DW_AT_decl_column : 3
    <d9f>   DW_AT_type        : <0xd73>
 <1><da3>: Abbrev Number: 16 (DW_TAG_enumeration_type)
    <da4>   DW_AT_encoding    : 7	(unsigned)
    <da4>   DW_AT_byte_size   : 1
    <da4>   DW_AT_type        : <0x606>
    <da8>   DW_AT_decl_file   : 7
    <da9>   DW_AT_decl_line   : 55
    <daa>   DW_AT_decl_column : 1
    <daa>   DW_AT_sibling     : <0xdbb>
 <2><dae>: Abbrev Number: 7 (DW_TAG_enumerator)
    <daf>   DW_AT_name        : (indirect string, offset: 0x140c46): HAL_UNLOCKED
    <db3>   DW_AT_const_value : 0
 <2><db4>: Abbrev Number: 7 (DW_TAG_enumerator)
    <db5>   DW_AT_name        : (indirect string, offset: 0x140d36): HAL_LOCKED
    <db9>   DW_AT_const_value : 1
 <2><dba>: Abbrev Number: 0
 <1><dbb>: Abbrev Number: 4 (DW_TAG_typedef)
    <dbc>   DW_AT_name        : (indirect string, offset: 0x140d26): HAL_LockTypeDef
    <dc0>   DW_AT_decl_file   : 7
    <dc1>   DW_AT_decl_line   : 58
    <dc2>   DW_AT_decl_column : 3
    <dc3>   DW_AT_type        : <0xda3>
 <1><dc7>: Abbrev Number: 16 (DW_TAG_enumeration_type)
    <dc8>   DW_AT_encoding    : 7	(unsigned)
    <dc8>   DW_AT_byte_size   : 1
    <dc8>   DW_AT_type        : <0x606>
    <dcc>   DW_AT_decl_file   : 8
    <dcd>   DW_AT_decl_line   : 69
    <dce>   DW_AT_decl_column : 1
    <dce>   DW_AT_sibling     : <0xddf>
 <2><dd2>: Abbrev Number: 7 (DW_TAG_enumerator)
    <dd3>   DW_AT_name        : (indirect string, offset: 0x1414d1): GPIO_PIN_RESET
    <dd7>   DW_AT_const_value : 0
 <2><dd8>: Abbrev Number: 7 (DW_TAG_enumerator)
    <dd9>   DW_AT_name        : (indirect string, offset: 0x140e7d): GPIO_PIN_SET
    <ddd>   DW_AT_const_value : 1
 <2><dde>: Abbrev Number: 0
 <1><ddf>: Abbrev Number: 4 (DW_TAG_typedef)
    <de0>   DW_AT_name        : (indirect string, offset: 0x1417f3): GPIO_PinState
    <de4>   DW_AT_decl_file   : 8
    <de5>   DW_AT_decl_line   : 72
    <de6>   DW_AT_decl_column : 3
    <de7>   DW_AT_type        : <0xdc7>
 <1><deb>: Abbrev Number: 22 (DW_TAG_structure_type)
    <dec>   DW_AT_byte_size   : 28
    <ded>   DW_AT_decl_file   : 9
    <ded>   DW_AT_decl_line   : 47
    <dee>   DW_AT_decl_column : 9
    <dee>   DW_AT_sibling     : <0xe47>
 <2><df2>: Abbrev Number: 8 (DW_TAG_member)
    <df3>   DW_AT_name        : (indirect string, offset: 0x1413b2): QuickMeasure
    <df7>   DW_AT_decl_file   : 9
    <df7>   DW_AT_decl_line   : 49
    <df8>   DW_AT_decl_column : 12
    <df9>   DW_AT_type        : <0xbe2>
    <dfd>   DW_AT_data_member_location: 0
 <2><dfe>: Abbrev Number: 8 (DW_TAG_member)
    <dff>   DW_AT_name        : (indirect string, offset: 0x141801): RefClock
    <e03>   DW_AT_decl_file   : 9
    <e03>   DW_AT_decl_line   : 52
    <e04>   DW_AT_decl_column : 12
    <e05>   DW_AT_type        : <0xbe2>
    <e09>   DW_AT_data_member_location: 4
 <2><e0a>: Abbrev Number: 8 (DW_TAG_member)
    <e0b>   DW_AT_name        : (indirect string, offset: 0x14173f): TriggerInput
    <e0f>   DW_AT_decl_file   : 9
    <e0f>   DW_AT_decl_line   : 55
    <e10>   DW_AT_decl_column : 12
    <e11>   DW_AT_type        : <0xbe2>
    <e15>   DW_AT_data_member_location: 8
 <2><e16>: Abbrev Number: 8 (DW_TAG_member)
    <e17>   DW_AT_name        : (indirect string, offset: 0x140e0c): SamplingTime
    <e1b>   DW_AT_decl_file   : 9
    <e1b>   DW_AT_decl_line   : 58
    <e1c>   DW_AT_decl_column : 12
    <e1d>   DW_AT_type        : <0xbe2>
    <e21>   DW_AT_data_member_location: 12
 <2><e22>: Abbrev Number: 8 (DW_TAG_member)
    <e23>   DW_AT_name        : (indirect string, offset: 0x142a58): Divider
    <e27>   DW_AT_decl_file   : 9
    <e27>   DW_AT_decl_line   : 61
    <e28>   DW_AT_decl_column : 12
    <e29>   DW_AT_type        : <0xbe2>
    <e2d>   DW_AT_data_member_location: 16
 <2><e2e>: Abbrev Number: 8 (DW_TAG_member)
    <e2f>   DW_AT_name        : (indirect string, offset: 0x1406fa): HighThreshold
    <e33>   DW_AT_decl_file   : 9
    <e33>   DW_AT_decl_line   : 64
    <e34>   DW_AT_decl_column : 12
    <e35>   DW_AT_type        : <0xbe2>
    <e39>   DW_AT_data_member_location: 20
 <2><e3a>: Abbrev Number: 8 (DW_TAG_member)
    <e3b>   DW_AT_name        : (indirect string, offset: 0x1405ed): LowThreshold
    <e3f>   DW_AT_decl_file   : 9
    <e3f>   DW_AT_decl_line   : 66
    <e40>   DW_AT_decl_column : 12
    <e41>   DW_AT_type        : <0xbe2>
    <e45>   DW_AT_data_member_location: 24
 <2><e46>: Abbrev Number: 0
 <1><e47>: Abbrev Number: 4 (DW_TAG_typedef)
    <e48>   DW_AT_name        : (indirect string, offset: 0x14132c): DTS_InitTypeDef
    <e4c>   DW_AT_decl_file   : 9
    <e4d>   DW_AT_decl_line   : 68
    <e4e>   DW_AT_decl_column : 3
    <e4f>   DW_AT_type        : <0xdeb>
 <1><e53>: Abbrev Number: 16 (DW_TAG_enumeration_type)
    <e54>   DW_AT_encoding    : 7	(unsigned)
    <e54>   DW_AT_byte_size   : 1
    <e54>   DW_AT_type        : <0x606>
    <e58>   DW_AT_decl_file   : 9
    <e59>   DW_AT_decl_line   : 74
    <e5a>   DW_AT_decl_column : 1
    <e5a>   DW_AT_sibling     : <0xe7d>
 <2><e5e>: Abbrev Number: 7 (DW_TAG_enumerator)
    <e5f>   DW_AT_name        : (indirect string, offset: 0x140bf8): HAL_DTS_STATE_RESET
    <e63>   DW_AT_const_value : 0
 <2><e64>: Abbrev Number: 7 (DW_TAG_enumerator)
    <e65>   DW_AT_name        : (indirect string, offset: 0x1406af): HAL_DTS_STATE_READY
    <e69>   DW_AT_const_value : 1
 <2><e6a>: Abbrev Number: 7 (DW_TAG_enumerator)
    <e6b>   DW_AT_name        : (indirect string, offset: 0x1417e0): HAL_DTS_STATE_BUSY
    <e6f>   DW_AT_const_value : 2
 <2><e70>: Abbrev Number: 7 (DW_TAG_enumerator)
    <e71>   DW_AT_name        : (indirect string, offset: 0x14135b): HAL_DTS_STATE_TIMEOUT
    <e75>   DW_AT_const_value : 3
 <2><e76>: Abbrev Number: 7 (DW_TAG_enumerator)
    <e77>   DW_AT_name        : (indirect string, offset: 0x141300): HAL_DTS_STATE_ERROR
    <e7b>   DW_AT_const_value : 4
 <2><e7c>: Abbrev Number: 0
 <1><e7d>: Abbrev Number: 4 (DW_TAG_typedef)
    <e7e>   DW_AT_name        : (indirect string, offset: 0x141068): HAL_DTS_StateTypeDef
    <e82>   DW_AT_decl_file   : 9
    <e83>   DW_AT_decl_line   : 81
    <e84>   DW_AT_decl_column : 3
    <e85>   DW_AT_type        : <0xe53>
 <1><e89>: Abbrev Number: 17 (DW_TAG_volatile_type)
    <e8a>   DW_AT_type        : <0xe7d>
 <1><e8e>: Abbrev Number: 22 (DW_TAG_structure_type)
    <e8f>   DW_AT_byte_size   : 36
    <e90>   DW_AT_decl_file   : 9
    <e90>   DW_AT_decl_line   : 89
    <e91>   DW_AT_decl_column : 9
    <e91>   DW_AT_sibling     : <0xec6>
 <2><e95>: Abbrev Number: 8 (DW_TAG_member)
    <e96>   DW_AT_name        : (indirect string, offset: 0x140b6a): Instance
    <e9a>   DW_AT_decl_file   : 9
    <e9a>   DW_AT_decl_line   : 92
    <e9b>   DW_AT_decl_column : 31
    <e9c>   DW_AT_type        : <0xec6>
    <ea0>   DW_AT_data_member_location: 0
 <2><ea1>: Abbrev Number: 8 (DW_TAG_member)
    <ea2>   DW_AT_name        : (indirect string, offset: 0x14792d): Init
    <ea6>   DW_AT_decl_file   : 9
    <ea6>   DW_AT_decl_line   : 93
    <ea7>   DW_AT_decl_column : 30
    <ea8>   DW_AT_type        : <0xe47>
    <eac>   DW_AT_data_member_location: 4
 <2><ead>: Abbrev Number: 8 (DW_TAG_member)
    <eae>   DW_AT_name        : (indirect string, offset: 0x127b88): Lock
    <eb2>   DW_AT_decl_file   : 9
    <eb2>   DW_AT_decl_line   : 94
    <eb3>   DW_AT_decl_column : 30
    <eb4>   DW_AT_type        : <0xdbb>
    <eb8>   DW_AT_data_member_location: 32
 <2><eb9>: Abbrev Number: 8 (DW_TAG_member)
    <eba>   DW_AT_name        : (indirect string, offset: 0x149638): State
    <ebe>   DW_AT_decl_file   : 9
    <ebe>   DW_AT_decl_line   : 95
    <ebf>   DW_AT_decl_column : 30
    <ec0>   DW_AT_type        : <0xe89>
    <ec4>   DW_AT_data_member_location: 33
 <2><ec5>: Abbrev Number: 0
 <1><ec6>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <ec7>   DW_AT_byte_size   : 4
    <ec7>   DW_AT_type        : <0xd66>
 <1><ecb>: Abbrev Number: 4 (DW_TAG_typedef)
    <ecc>   DW_AT_name        : (indirect string, offset: 0x1413f3): DTS_HandleTypeDef
    <ed0>   DW_AT_decl_file   : 9
    <ed1>   DW_AT_decl_line   : 107
    <ed2>   DW_AT_decl_column : 3
    <ed3>   DW_AT_type        : <0xe8e>
 <1><ed7>: Abbrev Number: 18 (DW_TAG_array_type)
    <ed8>   DW_AT_type        : <0xbbe>
    <edc>   DW_AT_sibling     : <0xee8>
 <2><ee0>: Abbrev Number: 28 (DW_TAG_subrange_type)
    <ee1>   DW_AT_type        : <0x5d7>
    <ee5>   DW_AT_upper_bound : 1023
 <2><ee7>: Abbrev Number: 0
 <1><ee8>: Abbrev Number: 5 (DW_TAG_variable)
    <ee9>   DW_AT_name        : (indirect string, offset: 0x1414e0): thread_stack1
    <eed>   DW_AT_decl_file   : 1
    <eed>   DW_AT_decl_line   : 51
    <eee>   DW_AT_decl_column : 9
    <eef>   DW_AT_type        : <0xed7>
    <ef3>   DW_AT_external    : 1
    <ef3>   DW_AT_location    : 5 byte block: 3 bc 4 0 20 	(DW_OP_addr: 200004bc)
 <1><ef9>: Abbrev Number: 5 (DW_TAG_variable)
    <efa>   DW_AT_name        : (indirect string, offset: 0x14146e): thread_ptr1
    <efe>   DW_AT_decl_file   : 1
    <efe>   DW_AT_decl_line   : 52
    <eff>   DW_AT_decl_column : 11
    <f00>   DW_AT_type        : <0xa35>
    <f04>   DW_AT_external    : 1
    <f04>   DW_AT_location    : 5 byte block: 3 bc 8 0 20 	(DW_OP_addr: 200008bc)
 <1><f0a>: Abbrev Number: 5 (DW_TAG_variable)
    <f0b>   DW_AT_name        : (indirect string, offset: 0x1414ee): thread_stack2
    <f0f>   DW_AT_decl_file   : 1
    <f0f>   DW_AT_decl_line   : 53
    <f10>   DW_AT_decl_column : 9
    <f11>   DW_AT_type        : <0xed7>
    <f15>   DW_AT_external    : 1
    <f15>   DW_AT_location    : 5 byte block: 3 6c 9 0 20 	(DW_OP_addr: 2000096c)
 <1><f1b>: Abbrev Number: 5 (DW_TAG_variable)
    <f1c>   DW_AT_name        : (indirect string, offset: 0x14147a): thread_ptr2
    <f20>   DW_AT_decl_file   : 1
    <f20>   DW_AT_decl_line   : 54
    <f21>   DW_AT_decl_column : 11
    <f22>   DW_AT_type        : <0xa35>
    <f26>   DW_AT_external    : 1
    <f26>   DW_AT_location    : 5 byte block: 3 6c d 0 20 	(DW_OP_addr: 20000d6c)
 <1><f2c>: Abbrev Number: 5 (DW_TAG_variable)
    <f2d>   DW_AT_name        : (indirect string, offset: 0x1414fc): thread_stack3
    <f31>   DW_AT_decl_file   : 1
    <f31>   DW_AT_decl_line   : 55
    <f32>   DW_AT_decl_column : 9
    <f33>   DW_AT_type        : <0xed7>
    <f37>   DW_AT_external    : 1
    <f37>   DW_AT_location    : 5 byte block: 3 1c e 0 20 	(DW_OP_addr: 20000e1c)
 <1><f3d>: Abbrev Number: 5 (DW_TAG_variable)
    <f3e>   DW_AT_name        : (indirect string, offset: 0x141486): thread_ptr3
    <f42>   DW_AT_decl_file   : 1
    <f42>   DW_AT_decl_line   : 56
    <f43>   DW_AT_decl_column : 11
    <f44>   DW_AT_type        : <0xa35>
    <f48>   DW_AT_external    : 1
    <f48>   DW_AT_location    : 5 byte block: 3 1c 12 0 20 	(DW_OP_addr: 2000121c)
 <1><f4e>: Abbrev Number: 5 (DW_TAG_variable)
    <f4f>   DW_AT_name        : (indirect string, offset: 0x141277): semaphore_0
    <f53>   DW_AT_decl_file   : 1
    <f53>   DW_AT_decl_line   : 58
    <f54>   DW_AT_decl_column : 14
    <f55>   DW_AT_type        : <0xba3>
    <f59>   DW_AT_external    : 1
    <f59>   DW_AT_location    : 5 byte block: 3 cc 12 0 20 	(DW_OP_addr: 200012cc)
 <1><f5f>: Abbrev Number: 5 (DW_TAG_variable)
    <f60>   DW_AT_name        : (indirect string, offset: 0x141225): temp_thread_ptr
    <f64>   DW_AT_decl_file   : 1
    <f64>   DW_AT_decl_line   : 60
    <f65>   DW_AT_decl_column : 11
    <f66>   DW_AT_type        : <0xa35>
    <f6a>   DW_AT_external    : 1
    <f6a>   DW_AT_location    : 5 byte block: 3 e8 12 0 20 	(DW_OP_addr: 200012e8)
 <1><f70>: Abbrev Number: 5 (DW_TAG_variable)
    <f71>   DW_AT_name        : (indirect string, offset: 0x141147): uart_thread_ptr
    <f75>   DW_AT_decl_file   : 1
    <f75>   DW_AT_decl_line   : 61
    <f76>   DW_AT_decl_column : 11
    <f77>   DW_AT_type        : <0xa35>
    <f7b>   DW_AT_external    : 1
    <f7b>   DW_AT_location    : 5 byte block: 3 98 13 0 20 	(DW_OP_addr: 20001398)
 <1><f81>: Abbrev Number: 5 (DW_TAG_variable)
    <f82>   DW_AT_name        : (indirect string, offset: 0x141350): temp_queue
    <f86>   DW_AT_decl_file   : 1
    <f86>   DW_AT_decl_line   : 62
    <f87>   DW_AT_decl_column : 10
    <f88>   DW_AT_type        : <0xb22>
    <f8c>   DW_AT_external    : 1
    <f8c>   DW_AT_location    : 5 byte block: 3 48 14 0 20 	(DW_OP_addr: 20001448)
 <1><f92>: Abbrev Number: 5 (DW_TAG_variable)
    <f93>   DW_AT_name        : (indirect string, offset: 0x140dc3): temp_thread_stack
    <f97>   DW_AT_decl_file   : 1
    <f97>   DW_AT_decl_line   : 63
    <f98>   DW_AT_decl_column : 9
    <f99>   DW_AT_type        : <0xed7>
    <f9d>   DW_AT_external    : 1
    <f9d>   DW_AT_location    : 5 byte block: 3 80 14 0 20 	(DW_OP_addr: 20001480)
 <1><fa3>: Abbrev Number: 5 (DW_TAG_variable)
    <fa4>   DW_AT_name        : (indirect string, offset: 0x140fec): uart_thread_stack
    <fa8>   DW_AT_decl_file   : 1
    <fa8>   DW_AT_decl_line   : 64
    <fa9>   DW_AT_decl_column : 9
    <faa>   DW_AT_type        : <0xed7>
    <fae>   DW_AT_external    : 1
    <fae>   DW_AT_location    : 5 byte block: 3 80 18 0 20 	(DW_OP_addr: 20001880)
 <1><fb4>: Abbrev Number: 18 (DW_TAG_array_type)
    <fb5>   DW_AT_type        : <0x68b>
    <fb9>   DW_AT_sibling     : <0xfc4>
 <2><fbd>: Abbrev Number: 20 (DW_TAG_subrange_type)
    <fbe>   DW_AT_type        : <0x5d7>
    <fc2>   DW_AT_upper_bound : 255
 <2><fc3>: Abbrev Number: 0
 <1><fc4>: Abbrev Number: 5 (DW_TAG_variable)
    <fc5>   DW_AT_name        : (indirect string, offset: 0x141462): queue_stack
    <fc9>   DW_AT_decl_file   : 1
    <fc9>   DW_AT_decl_line   : 65
    <fca>   DW_AT_decl_column : 7
    <fcb>   DW_AT_type        : <0xfb4>
    <fcf>   DW_AT_external    : 1
    <fcf>   DW_AT_location    : 5 byte block: 3 80 1c 0 20 	(DW_OP_addr: 20001c80)
 <1><fd5>: Abbrev Number: 29 (DW_TAG_variable)
    <fd6>   DW_AT_name        : (indirect string, offset: 0x1413ad): hdts
    <fda>   DW_AT_decl_file   : 1
    <fdb>   DW_AT_decl_line   : 69
    <fdc>   DW_AT_decl_column : 26
    <fdd>   DW_AT_type        : <0xecb>
    <fe1>   DW_AT_external    : 1
    <fe1>   DW_AT_declaration : 1
 <1><fe1>: Abbrev Number: 5 (DW_TAG_variable)
    <fe2>   DW_AT_name        : (indirect string, offset: 0x140639): Temperature
    <fe6>   DW_AT_decl_file   : 1
    <fe6>   DW_AT_decl_line   : 70
    <fe7>   DW_AT_decl_column : 9
    <fe8>   DW_AT_type        : <0xbd6>
    <fec>   DW_AT_external    : 1
    <fec>   DW_AT_location    : 5 byte block: 3 80 20 0 20 	(DW_OP_addr: 20002080)
 <1><ff2>: Abbrev Number: 9 (DW_TAG_subprogram)
    <ff3>   DW_AT_external    : 1
    <ff3>   DW_AT_name        : (indirect string, offset: 0xb5e10): _txe_queue_receive
    <ff7>   DW_AT_decl_file   : 4
    <ff8>   DW_AT_decl_line   : 1660
    <ffa>   DW_AT_decl_column : 13
    <ffb>   DW_AT_prototyped  : 1
    <ffb>   DW_AT_type        : <0x673>
    <fff>   DW_AT_declaration : 1
    <fff>   DW_AT_sibling     : <0x1013>
 <2><1003>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <1004>   DW_AT_type        : <0x1013>
 <2><1008>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <1009>   DW_AT_type        : <0x654>
 <2><100d>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <100e>   DW_AT_type        : <0x68b>
 <2><1012>: Abbrev Number: 0
 <1><1013>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <1014>   DW_AT_byte_size   : 4
    <1014>   DW_AT_type        : <0xb22>
 <1><1018>: Abbrev Number: 9 (DW_TAG_subprogram)
    <1019>   DW_AT_external    : 1
    <1019>   DW_AT_name        : (indirect string, offset: 0x140f2f): HAL_DTS_Stop
    <101d>   DW_AT_decl_file   : 9
    <101e>   DW_AT_decl_line   : 443
    <1020>   DW_AT_decl_column : 19
    <1021>   DW_AT_prototyped  : 1
    <1021>   DW_AT_type        : <0xd97>
    <1025>   DW_AT_declaration : 1
    <1025>   DW_AT_sibling     : <0x102f>
 <2><1029>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <102a>   DW_AT_type        : <0x102f>
 <2><102e>: Abbrev Number: 0
 <1><102f>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <1030>   DW_AT_byte_size   : 4
    <1030>   DW_AT_type        : <0xecb>
 <1><1034>: Abbrev Number: 9 (DW_TAG_subprogram)
    <1035>   DW_AT_external    : 1
    <1035>   DW_AT_name        : (indirect string, offset: 0xc7344): _txe_queue_send
    <1039>   DW_AT_decl_file   : 4
    <103a>   DW_AT_decl_line   : 1661
    <103c>   DW_AT_decl_column : 13
    <103d>   DW_AT_prototyped  : 1
    <103d>   DW_AT_type        : <0x673>
    <1041>   DW_AT_declaration : 1
    <1041>   DW_AT_sibling     : <0x1055>
 <2><1045>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <1046>   DW_AT_type        : <0x1013>
